{
    "namespace": "OS::Compute::Hypervisor",
    "display_name": "Hypervisor Selection",
    "description": "OpenStack Compute supports many hypervisors, although most installations use only one hypervisor. For installations with multiple supported hypervisors, you can schedule different hypervisors using the ImagePropertiesFilter. This filters compute nodes that satisfy any architecture, hypervisor type, or virtual machine mode properties specified on the instance's image properties.",
    "visibility": "public",
    "protected": true,
    "resource_type_associations": [
        {
            "name": "OS::Glance::Image"
        }
    ],
    "properties": {
        "hypervisor_type": {
            "title": "Hypervisor Type",
            "description": "Hypervisor type required by the image. Used with the ImagePropertiesFilter. \n\n Baremetal - physical provisioning. hyperv - Microsoft® hyperv. KVM - Kernel-based Virtual Machine. LXC - Linux Containers (through libvirt). powervm - IBM® PowerVM®. QEMU - Quick EMUlator. UML - User Mode Linux. vmware - VMware® vsphere. VZ - Virtuozzo OS Containers and Virtual Machines (through libvirt). For more information, see: https://docs.openstack.org/nova/latest/admin/configuration/hypervisors.html",
            "type": "string",
            "enum": [
                "baremetal",
                "hyperv",
                "kvm",
                "lxc",
                "powervm",
                "qemu",
                "uml",
                "vmware",
                "vz",
                "xen"
            ]
        },
        "vm_mode": {
            "title": "VM Mode",
            "description": "The virtual machine mode. This represents the host/guest ABI (application binary interface) used for the virtual machine. Used with the ImagePropertiesFilter. \n\n hvm — Fully virtualized - This is the virtual machine mode (vm_mode) used by QEMU and KVM. \n\n xen - Xen 3.0 paravirtualized. \n\n uml — User Mode Linux paravirtualized. \n\n exe — Executables in containers. This is the mode used by LXC.",
            "type": "string",
            "enum": [
                "hvm",
                "xen",
                "uml",
                "exe"
            ]
        }
    },
    "objects": []
}
