Repository: openstack/glance
Catalog: glance/locale/*/LC_MESSAGES/glance-log-warning.po
Languages: es, ko_kr

source: %(image_id)s: field %(key)s differs (source is %(master_value)s, destination is %(slave_value)s)
es: %(image_id)s: campo %(key)s difiere (fuente es %(master_value)s, destino es %(slave_value)s)
ko_kr: %(image_id)s: 필드 %(key)s이(가) 다름(소스는 %(master_value)s, 대상은 %(slave_value)s)

source: /v3 controller is deprecated and will be removed from glance-api soon. Remove the reference to it from glance-api-paste.ini configuration file and use Glance Artifact Service API instead
ko_kr: /v3 컨트롤러는 더 이상 사용되지 않으므로 glance-api에서 곧 제거됩니다. glance-api-paste.ini 구성 파일에서 참조를 제거하고 대신 Glance Artifact Service API를 사용하십시오.

source: Access denied to image %(id)s but returning 'not found'
es: Acceso denegado a la imagen %(id)s aunque se devuelve 'not found'
ko_kr: 이미지 %(id)s에 대한 액세스가 거부되었지만 '찾을 수 없음'이 리턴됨

source: An optional task has failed, the failure was: %s
es: Ha fallado una tarea opcional, el error fue: %s
ko_kr: 옵션 작업이 실패했습니다. 실패 내용: %s

source: Artifact with id=%s is not accessible
es: No se puede acceder al artefacto con id=%s
ko_kr: id=%s인 아티팩트에 액세스할 수 없음

source: Artifact with id=%s not found
es: No se encontró artefacto con id=%s
ko_kr: id=%s인 아티팩트를 찾을 수 없음

source: Artifact with the specified type, name and version already exists
es: Ya existe artefacto con el tipo, nombre versión especificada
ko_kr: 지정된 유형, 이름, 버전을 사용하는 아티팩트가 이미 있음

source: Artifact with the specified type, name and version already has the direct dependency=%d
es: El artefacto con el tipo, nombre versión especificada ya tiene la dependencia directa=%d
ko_kr: 지정된 유형, 이름, 버전을 사용하는 아티팩트에 이미 직접 종속성= %d이(가) 있음

source: Artifact with the specified type, name and versions already has the direct dependency=%s
es: El artefacto con el tipo, nombre versión especificada ya tiene la dependencia directa=%s
ko_kr: 지정된 유형, 이름, 버전을 사용하는 아티팩트에 이미 직접 종속성=%s이(가) 있음

source: Attempted to modify image user did not own.
es: Se ha intentado modificar una imagen que no era propiedad del usuario.
ko_kr: 사용자가 소유하지 않은 이미지를 수정하려고 시도했습니다.

source: Cached image file '%s' doesn't exist, unable to delete
es: El archivo de imagen almacenado en memoria caché '%s' no existe, no se puede suprimir
ko_kr: 캐시된 이미지 파일 '%s'이(가) 없음, 삭제할 수 없음

source: Can't load artifact %s: load disabled in config
es: No se puede cargar artefacto %s: la carga no está habilitada en la configuración
ko_kr: 아티팩트 %s을(를) 로드할 수 없음: 구성에서 로드가 비활성화됨

source: Can't load artifact %s: not in available_plugins list
es: No se puede cargar artefacto %s: no en lista available_plugins
ko_kr: 아티팩트 %s을(를) 로드할 수 없음: available_plugins 목록에 없음

source: Could not find image %s
es: No se ha podido encontrar la imagen %s
ko_kr: 이미지 %s을(를) 찾을 수 없음

source: Could not find schema properties file %s. Continuing without custom properties
es: No se ha podido encontrar el archivo de propiedades del esquema %s. Se va a continuar sin las propiedades personalizadas
ko_kr: 스키마 특성 파일 %s을(를) 찾을 수 없습니다. 사용자 지정 특성 없이 계속합니다.

source: Could not find task %s
es: No se encontró tarea %s
ko_kr: 작업 %s을(를) 찾을 수 없음

source: Could not find task info %s
es: No se encontró información de tarea %s
ko_kr: 작업 정보 %s을(를) 찾을 수 없음

source: Deadlock detected. Retrying...
es: Punto muerto detectado. Intentando de nuevo...
ko_kr: 데드락 발견됨, 재시도중

source: Duplicate entry for values: %s
es: Conexión para valores duplicada: %s
ko_kr: 중복된 엔트리 값: %s

source: Expected table %(tbl)s was not found in DB.
ko_kr: 예상 테이블 %(tbl)s을(를) DB에서 찾을 수 없습니다.

source: Failed to activate image %s in registry. About to delete image bits from store and update status to 'killed'.
es: No se pudo activar imagen %s en registro. A punto de eliminar bits de imagen del almacen y actualizar estado a 'killed'.
ko_kr: 레지스트리에서 이미지 %s을(를) 활성화하는 데 실패했습니다. 곧 저장소에서 이미지 비트를 삭제하고 상태를 'killed'로 업데이트합니다.

source: Failed to decrypt location value for image %(image_id)s
es: Error al decodificar valor de ubicación para imagen %(image_id)s
ko_kr: 이미지 %(image_id)s의 위치 값을 암호 해제하는 데 실패

source: Failed to delete blob %s in store from URI
es: No se eliminó objeto %s en almacén de URI
ko_kr: URI에서 저장소의 blob %s을(를) 삭제하는 데 실패

source: Failed to delete file %(path)s. Got error: %(e)s
es: No se ha eliminado fichero %(path)s. Tuvo error: %(e)s
ko_kr: 파일 %(path)s을(를) 삭제하지 못했습니다. 오류 발생: %(e)s

source: Failed to delete image %s in store from URI
es: No se eliminó imagen %s en almacén de URI
ko_kr: URI에서 저장소의 이미지 %s을(를) 삭제하는 데 실패

source: Failed to find task %(task_id)s. Reason: %(reason)s
es: No se encontró tarea %(task_id)s. Razón: %(reason)s
ko_kr: 작업 %(task_id)s을(를) 찾지 못했습니다. 이유: %(reason)s

source: Failed to successfully cache all images in queue.
es: No se ha podido almacenar en memoria caché satisfactoriamente todas las imágenes en cola.
ko_kr: 대기열에서 모든 이미지를 성공적으로 캐시하지 못했습니다.

source: Fetch of cache file failed (%(e)s), rolling back by moving '%(incomplete_path)s' to '%(invalid_path)s'
es: Se ha encontrado un error en la captación del archivo de memoria caché (%(e)s), se va a retrotraer moviendo '%(incomplete_path)s' a '%(invalid_path)s'
ko_kr: 캐시 파일 가져오기 실패%(e)s), '%(incomplete_path)s'을(를) '%(invalid_path)s'(으)로 이동하여 롤백

source: Forbidden to create task. Reason: %(reason)s
es: Se olvidó crear tarea. Razón: %(reason)s
ko_kr: 작업 생성이 금지되었습니다. 이유: %(reason)s

source: Forbidden to get task %(task_id)s. Reason: %(reason)s
es: Se olvidó obtener tarea %(task_id)s. Razón: %(reason)s
ko_kr: 작업 %(task_id)s 가져오기가 금지되었습니다. 이유: %(reason)s

source: Id not in sort_keys; is sort_keys unique?
es: Id no está en sort_keys; ¿es sort_keys exclusivo?
ko_kr: ID가 sort_keys에 없습니다. sort_keys가 고유합니까?

source: Image %s entirely missing from the destination
es: Falta la totalidad de la imagen %s del destino
ko_kr: 이미지 %s이(가) 대상에서 완전히 누락되어 있음

source: Image '%s' is not active. Not caching.
es: La imagen '%s' no está activa. No almacenando en memoria caché.
ko_kr: 이미지 '%s'이(가) 활성이 아닙니다. 캐시되지 않습니다.

source: Image cache driver '%(driver_module)s' failed to configure. Got error: '%(config_err)s
es: El controlador de caché de imágenes '%(driver_module)s' no se ha podido configurar. Se ha obtenido el error: '%(config_err)s
ko_kr: 이미지 캐시 드라이버 '%(driver_module)s'을(를) 구성하지 못했습니다. 오류 발생: '%(config_err)s

source: Image cache driver '%(driver_name)s' failed to load. Got error: '%(import_err)s.
es: El controlador de caché de imágenes '%(driver_name)s' no se ha podido cargar. Se ha obtenido el error: '%(import_err)s.
ko_kr: 이미지 캐시 드라이버 '%(driver_name)s'을(를) 로드하지 못했습니다. 오류 발생: '%(import_err)s.

source: Invalid marker. Image %(id)s could not be found.
es: Marcador no válido. No se puede encontrar imagen %(id)s.
ko_kr: 올바르지 않은 마커입니다. 이미지 %(id)s을(를) 찾을 수 없습니다.

source: Invalid membership association specified for image %(id)s
es: Se ha especificado una asociación de pertenencia no válida para la imagen %(id)s
ko_kr: 이미지 %(id)s에 대해 올바르지 않은 멤버십 연관이 지정됨

source: Member %(id)s not found
es: No se ha encontrado el miembro %(id)s
ko_kr: 구성원 %(id)s 발견되지 않음

source: Metadata tag not found for id %s
es: No se ha encontrado etiqueta de metadatos para id%s
ko_kr: ID %s에 대한 메타데이터 태그를 찾을 수 없음

source: No metadata found for image '%s'
es: No se han encontrado metadatos para la imagen '%s'
ko_kr: image의 메어 자료가 없음 '%s'

source: One or more image locations couldn't be scrubbed from backend. Leaving image '%s' in 'pending_delete' status
ko_kr: 백엔드에서 하나 이상의 이미지 위치를 삭제할 수 없습니다. 이미지 '%s'의 상태를 'pending_delete'로 남겨 둠

source: Show level %s is not supported in this operation
es: EL nivel de vista %s no es soportado por esta operación
ko_kr: 이 조작에서는 표시 레벨 %s이(가) 지원되지 않음

source: Task %(task_id)s failed with exception %(error)s
es: Tarea %(task_id)s falló con exceepción %(error)s
ko_kr: 작업 %(task_id)s에 실패하고 예외 %(error)s 발생

source: The `eventlet` executor has been deprecated. Use `taskflow` instead.
es: Se ha desaprobado el uso del ejecutor `eventlet`. En su lugar use `taskflow`.
ko_kr: `eventlet` 실행자는 더 이상 사용되지 않습니다. 대신 `taskflow`를 사용하십시오.

source: The conversion format is None, please add a value for it in the config file for this task to work: %s
es: No hay formato de conversión, por favor agregue un valor para éste en el fichero de configuración para esta tarea en el trabajo: %s
ko_kr: 변환 포맷이 None임, 이 태스크를 통해 작업할 구성 파일에 값 추가: %s

source: Unable to get deleted image
es: No se ha podido obtener una imagen suprimida
ko_kr: 삭제된 이미지를 가져올 수 없음

source: Unable to get deleted task %s
es: No se puede obtener tarea eliminada %s
ko_kr: 삭제된 작업 %s을(를) 가져올 수 없음

source: Unable to get unowned image
es: No se ha podido obtener una imagen que no es de su propiedad
ko_kr: 소유하지 않은 이미지를 가져올 수 없음

source: Unrecognised child %s
es: Hijo %s no reconocido
ko_kr: 인식되지 않은 하위 %s

source: User %(user)s attempted to upload an image of size %(size)d that will exceed the quota. %(remaining)d bytes remaining.
es: Usuario %(user)s intentó cargar una imagen de tamaño %(size)d que excede la capacidad. %(remaining)d bytes restantes.
ko_kr: 사용자 %(user)s이(가) 할당량을 초과하는 %(size)d 크기의 이미지를 업로드하려 했습니다. %(remaining)d바이트가 남아 있습니다.

source: User %(user)s attempted to upload an image of unknown size that will exceed the quota. %(remaining)d bytes remaining.
es: Usuario %(user)s intentó cargar una imagen de tamaño desconocido que excede la capacidad. %(remaining)d bytes restantes.
ko_kr: 사용자 %(user)s이(가) 할당량을 초과하는 알 수 없는 크기의 이미지를 업로드하려 했습니다. %(remaining)d바이트가 남아 있습니다.

source: User lacks permission to share image %(id)s
es: El usuario no tiene permiso para compartir la imagen %(id)s
ko_kr: 사용자가 이미지 %(id)s을(를) 공유할 권한이 없음
