Repository: openstack/glance
Catalog: glance/locale/*/LC_MESSAGES/glance-log-error.po
Languages: es, ko_kr, zh_cn

source: An error occurred during image.send notification: %(err)s
es: Se ha producido un error durante la notificación image.send :%(err)s
ko_kr: image.send notification 중 에러 발생 : %(err)s
zh_cn: 在映像发送通知期间发生错误：%(err)s

source: An error occurred reading from backend storage for image %(image_id)s: %(err)s
es: Se ha producido un error al leer en el almacenamiento del programa de fondo para la imagen %(image_id)s: %(err)s
ko_kr: 백엔드 스토리지에서 이미지 %(image_id)s를 읽는 중 에러 발생: %(err)s
zh_cn: 从映像 %(image_id)s 的后端存储器进行读取时发生错误：%(err)s

source: Backend storage for image %(image_id)s disconnected after writing only %(bytes_written)d bytes
es: El almacenamiento del programa de fondo para la imagen %(image_id)s se ha desconectado después de grabar solo %(bytes_written)d bytes
ko_kr: 백엔드 스토리지에 이미지 %(image_id)s 를 %(bytes_written)d byte 를 쓰는 도중 연결 끊김
zh_cn: 在仅写入 %(bytes_written)d 个字节之后，已从映像 %(image_id)s 的后端存储器断开连接

source: Can not get scrub jobs from queue: %s
es: No se puede obtener trabajos de depuración desde cola: %s
ko_kr: 대기열에서 삭제(scrub) 작업을 가져올 수 없음: %s
zh_cn: 无法从队列中获取临时作业：%s

source: Cannot use this parameter with the operator IN
es: No se puede utilizar este parámetro con el operador IN
ko_kr: 연산자 IN과 이 매개변수를 사용할 수 없음
zh_cn: 无法将此参数与运算符IN配合使用

source: Caught error: %s
es: Capturado error: %s
ko_kr: 오류 발견: %s
zh_cn: 抓到错误：%s

source: Checksum header is missing.
es: Falta la cabecera de suma de comprobación.
ko_kr: Checksum header 없음
zh_cn: 缺少校验和头。

source: Copy from external source '%(scheme)s' failed for image: %(image)s
es: Ha fallado la copia desde fuente externa '%(scheme)s' para imagen: %(image)s
ko_kr: 외부 소스 '%(scheme)s' 로부터 이미지 복사 실패 : %(image)s
zh_cn: 从外部源 %(scheme)s 复制镜像 %(image)s 失败

source: Could not load plugin from %(module)s
ko_kr: %(module)s에서 플러그인을 로드할 수 없음
zh_cn: 无法从%(module)s中加载插件

source: Couldn't find property protection file %(file)s: %(error)s.
es: No se pudo encontrar fichero de protección a propiedad %(file)s: %(error)s.
ko_kr: 특성 보호 파일 %(file)s을(를) 찾을 수 없음: %(error)s.
zh_cn: 无法找到属性保护文件%(file)s：%(error)s。

source: Encountered a malformed property protection rule %(rule)s: %(error)s.
es: Se encontró una regla de protección a la propiedad %(rule)s: %(error)s incorrecta.
ko_kr: 형식이 잘못된 특성 보호 규칙 %(rule)s이(가) 발생함: %(error)s.

source: Error executing SQLite call. Got error: %s
es: Error al ejecutar la llamada SQLite. Se ha obtenido error: %s
ko_kr: SQLLite call 수행중 에러 발생 : %s
zh_cn: 执行 SQLite 调用时出错。发生错误：%s

source: Error setting up the debug environment. Verify that the option pydev_worker_debug_host is pointing to a valid hostname or IP on which a pydev server is listening on the port indicated by pydev_worker_debug_port.
es: Error configurando el entorno de depuración. Verifique que la opción pydev_worker_debug_host señala un nombre de host o IP no válida en la cual un servidor pydev está escuchando respestas en el puerto indicado por pydev_worker_debug_port.
ko_kr: 디버그 환경을 설정하는 중 오류가 발생했습니다. pydev_worker_debug_host 옵션이 pydev_worker_debug_port로 표시된 포트에서 pydev 서버가 청취 중인 올바른 호스트 이름 또는 IP를 가르키는지 확인하십시오.

source: Error: cooperative_iter exception %s
es: Error: excepción de cooperative_iter %s
ko_kr: 오류: cooperative_iter 예외 %s
zh_cn: 错误：发生 cooperative_iter 异常 %s

source: Exception encountered while tee'ing image '%(image_id)s' into cache: %(error)s. Continuing with response.
es: Se ha encontrado una excepción al colocar la imagen '%(image_id)s' en la memoria caché: %(error)s. Continuando con la respuesta.
ko_kr: 이미지 '%(image_id)s'를 캐시에 올리는 중 Exception 발생: %(error)s. 응답과 함께 진행

source: Failed to delete blob %(blob_id)s from store: %(exc)s
es: No se borró objeto %(blob_id)s del almacén: %(exc)s
ko_kr: 저장소에서 blob %(blob_id)s을(를) 삭제하는 데 실패: %(exc)s
zh_cn: 从存储中删除id为%(blob_id)s的blob失败：%(exc)s

source: Failed to delete image %(image_id)s from store: %(exc)s
es: Error al eliminar imagen %(image_id)s de almacén: %(exc)s
ko_kr: 스토어에서 이미지 %(image_id)s 삭제 실패 : %(exc)s
zh_cn: 从存储中删除镜像%(image_id)s失败：%(exc)s

source: Failed to delete namespace %(namespace)s
es: No se eliminó el espacio de nombre %(namespace)s
ko_kr: 네임스페이스 삭제 실패 %(namespace)s
zh_cn: 删除命名空间 %(namespace)s 失败

source: Failed to execute introspection %(task_id)s: %(exc)s
es: Error al ejecutar introspección %(task_id)s: %(exc)s
ko_kr: 인트로스펙션(introspection) %(task_id)s을(를) 실행하는 데 실패: %(exc)s

source: Failed to execute security checks on the image %(task_id)s: %(exc)s
ko_kr: 이미지 %(task_id)s에서 보안 확인을 실행하는 데 실패: %(exc)s
zh_cn: 执行镜像 %(task_id)s 安全检查失败：%(exc)s

source: Failed to execute task %(task_id)s: %(exc)s
es: Error al ejecutar la tarea %(task_id)s: %(exc)s
ko_kr: 작업 %(task_id)s을(를) 실행하는 데 실패: %(exc)s
zh_cn: 执行任务 %(task_id)s 失败： %(exc)s

source: Failed to load location strategy module %(module)s: %(e)s
es: Error al cargar módulo de estrategia de localización %(module)s: %(e)s
ko_kr: 위치 전략 모듈 %(module)s을(를) 로드하는 데 실패: %(e)s
zh_cn: 未能加载定位策略模块%(module)s： %(e)s

source: Failed to load the %s executor provided in the config.
es: Error al cargar el ejecutor %s en la configuración.
ko_kr: 설정에서 제공된 %s executor 로드 실패
zh_cn: 加载配置文件中提供的%s执行器时失败。

source: Failed to parse json file %(file_path)s while populating metadata due to: %(error_msg)s
ko_kr: 다음 오류로 인해 메타데이터를 채우는 동안 json 파일 %(file_path)s을(를) 구문 분석하는 데 실패: %(error_msg)s
zh_cn: 填充元数据时解析json文件（%(file_path)s）失败，原因为：%(error_msg)s

source: Failed to save task %(task_id)s in DB as task_repo is %(task_repo)s
es: Error al guardar tarea %(task_id)s en base de datos como task_repo es %(task_repo)s
ko_kr: DB에 task_repo 형태로 작업 %(task_id)s 저장에 실패한 것은 %(task_repo)s

source: Failed to upload artifact blob data due to HTTP error
es: Se ha encontrado un error en la carga de datos de objetos artefactos debido a un error HTTP
ko_kr: HTTP 오류로 인해 아티팩트 blob 데이터를 업로드하는 데 실패
zh_cn: 由于 HTTP 错误，未能上载人工blob数据

source: Failed to upload artifact blob data due to internal error
es: Se ha encontrado un error en la carga de datos de objetos artefactos debido a un error interno
ko_kr: 내부 오류로 인해 아티팩트 blob 데이터를 업로드하는 데 실패
zh_cn: 由于内部错误，未能上载人工blob数据

source: Failed to upload image data due to HTTP error
es: Se ha encontrado un error en la carga de datos de imagen debido a un error HTTP
ko_kr: HTTP 에러로 인해 이미지 데이터 업로드 실패
zh_cn: 由于 HTTP 错误，未能上载映像数据

source: Failed to upload image data due to internal error
es: Se ha encontrado un error en la carga de datos de imagen debido a un error interno
ko_kr: 내부 에러로 인해 이미지 데이터 업로드 실패
zh_cn: 由于内部错误，未能上载映像数据

source: Forbidden to create resource type. Reason: %(reason)s
es: Se olvidó crear tipo de recurso. Razón: %(reason)s
ko_kr: 리소스타입 생성이 금지됨. 이유: %(reason)s
zh_cn: 禁止创建资源类型。原因： %(reason)s

source: Glance tried all active locations to get data for blob %s but all have failed.
es: Glance intentó obtener datos para el objeto %s desde todas las ubicaciones activas pero todas fallaron.
ko_kr: Glance가 모든 활성 위치에서 blob %s의 데이터를 가져오려 했지만 모두 실패했습니다.
zh_cn: Glance尝试从所有活跃点获取blob %s 数据但是全部失败

source: Glance tried all active locations to get data for image %s but all have failed.
es: Glance intentó obtener datos para la imagen %s de todas las ubicaciones activas pero todas fallaron.
ko_kr: Glance는 모든 활성화 된 위치에서 %s 이미지에 대한 데이터를 수집하려 했으나 모두 실패했습니다.

source: Image cache contained image file for image '%s', however the registry did not contain metadata for that image!
es: La memoria caché de imágenes contenía el archivo de imagen para la imagen '%s', sin embargo, el registro no contenía metadatos para dicha imagen.
ko_kr: 이미지 캐시에는 이미지 '%s'에 대한 이미지 파일이 있으나 레지스트리는 이미지에 대한 메타데이터를 가지고 있지 않습니다!
zh_cn: 映像高速缓存包含了映像“%s”的映像文件，但是注册表未包含该映像的元数据！

source: Internal error occurred while trying to process task.
es: Ocurrió un error interno al intentar procesar la tarea.
ko_kr: 작업을 수행하는 중 내부에러 발생
zh_cn: 当尝试处理任务时发生内部错误。

source: Invalid format of swift store config cfg
es: Formato de configuración de almacén de intercambio cfg no válido
ko_kr: 올바르지 않은 형식의 swift 저장소 구성 cfg
zh_cn: swift存储配置cfg格式无效

source: Invalid store uri for image: %(image_id)s. Details: %(reason)s
es: Almacén uri para imagene: %(image_id)s no válido. Detalles: %(reason)s
ko_kr: 이미지 %(image_id)s 에 부적합한 저장 uri. 상세: %(reason)s
zh_cn: 镜像 %(image_id)s的无效存储uri。详细信息：%(reason)s

source: Invalid value '%s' for 'property_protection_rule_format'. The permitted values are 'roles' and 'policies'
es: Valor no válido '%s' para 'property_protection_rule_format'. Los valores permitidos son 'roles' y 'policies'
ko_kr: 'property_protection_rule_format'의 값 '%s'이(가) 올바르지 않습니다. 허용되는 값은 'roles' 및 'policies'입니다.
zh_cn: “property_protection_rule_format”的值“%s”无效。允许的值为“roles”和“policies”

source: Invalid value for age, %(age)d
ko_kr: 기간에 올바르지 않은 값, %(age)d

source: Invalid value for max_rows, %(max_rows)d
ko_kr: max_rows에 올바르지 않은 값, %(max_rows)d

source: Invalid value for option user_storage_quota: %(users_quota)s
es: Opción para user_storage_quota: %(users_quota)s no válida
ko_kr: user_storage_quota 옵션에 올바르지 않은 값: %(users_quota)s
zh_cn: 选项 user_storage_quota:%(users_quota)s的无意义值

source: Json schema files not found in %s. Aborting.
es: No se encuentran ficheros de esquema Json en %s. Abortando.
ko_kr: %s에서 Json 스키마 파일을 찾을 수 없음. 중단.
zh_cn: 在%s中未找到Json模式文件。异常终止。

source: Malformed property protection rule in [%(prop)s] %(op)s=%(perm)s: '@' and '!' are mutually exclusive
es: Regla de protección a la propiedad incorrecta en [%(prop)s] %(op)s=%(perm)s: '@' y '!' son exclusivos mutuamente
ko_kr: [%(prop)s] %(op)s=%(perm)s의 형식이 잘못된 특성 보호 규칙: '@' 및 '!'는 상호 배타적임

source: Multiple policies '%s' not allowed for a given operation. Policies can be combined in the policy file
es: No se permiten políticas múltiples '%s' para una operación dada. Las políticas pueden combinarse en el fichero de política
ko_kr: 지정된 조작에는 여러 정책 '%s'이(가) 허용되지 않습니다. 정책은 정책 파일에서 결합할 수 있습니다.

source: Not respawning child %d, cannot recover from termination
es: No se va a volver a generar el hijo %d, no se puede recuperar de la terminación
ko_kr: 하위 %d을(를) 다시 복제하지 않음, 종료에서 복구할 수 없음
zh_cn: 未在重生子代 %d，无法从终止进行恢复

source: Operator %s is not supported
es: No se soporta operador %s
ko_kr: %s 연산자는 지원되지 않음
zh_cn: 运算符 %s 不受支持

source: Please provide no more than one option from this list: --prefer_new, --overwrite
es: Por favor proporcione no más que una opción de esta lista: --prefer_new, --overwrite
ko_kr: 이 목록에서 하나 이하의 옵션을 제공하십시오.: --prefer_new, --overwrite
zh_cn: 请提供不多于一个的选项（选项列表：--prefer_new, --overwrite）

source: RPC Call Error: %(val)s %(tb)s
es: Error de llamada RPC: %(val)s %(tb)s
ko_kr: RPC 호출 오류: %(val)s %(tb)s
zh_cn: RPC调用错误： %(val)s %(tb)s

source: Received HTTP error while uploading image %s
es: Se recibió un error HTTP mientras se cargaba imagen %s
ko_kr: 이미지 %s를 업로드 하는 도중 HTTP 에러 수신
zh_cn: 当上传镜像 %s时收到HTTP错误返回

source: Registry client request %(method)s %(action)s raised %(exc_name)s
es: La solicitud de cliente de registro %(method)s %(action)s ha producido %(exc_name)s
ko_kr: 레지스트리 클라이언트 요청 %(method)s %(action)s에서 %(exc_name)s이(가) 제기됨
zh_cn: 注册表客户机请求 %(method)s %(action)s 产生 %(exc_name)s

source: Signature verification failed for image %(id)s: %(e)s
ko_kr: 이미지 %(id)s의 서명 검증에 실패: %(e)s
zh_cn: 镜像 %(id)s:%(e)s签名认证失败

source: Task ID %s
es: Identificación de tarea %s
ko_kr: 작업 ID %s

source: Task [%(task_id)s] status failed to change from %(cur_status)s to %(new_status)s
es: Error al cambiar el estado de tarea [%(task_id)s] de %(cur_status)s a %(new_status)s
ko_kr: 작업 [%(task_id)s]상태를 %(cur_status)s에서 %(new_status)s(으)로 변경하는 데 실패
zh_cn: 任务（%(task_id)s）状态从%(cur_status)s修改为%(new_status)s时失败。

source: Task not found for task_id %s
es: No se ha encontrado tarea para task_id %s
ko_kr: task_id %s에 대한 작업을 찾을 수 없음
zh_cn: 未找到task_id为%s的任务

source: Task: %(task_id)s failed to import image %(image_id)s to the filesystem.
es: Tarea: %(task_id)s falló al importar imagen %(image_id)s al sistema de fichero.
ko_kr: 작업: %(task_id)s에서 파일 시스템에 이미지 %(image_id)s을(를) 가져오는 데 실패했습니다.
zh_cn: 任务： %(task_id)s 导出镜像 %(image_id)s 到文件系统失败。

source: This execution of Tasks is not setup. Please consult the project documentation for more information on the executors available.
es: No está configurada esta ejecución de tarea. Por favor consulte la documentación del proyecto en los ejecutores disponibles para más información.
ko_kr: 이 작업의 실행은 설정되지 않았습니다. 프로젝트 문서의 executors available 관련 항목을 참고하여 상세한 정보를 확인 하시기 바랍니다.

source: This task type %(task_type)s is not supported by the current deployment of Glance. Please refer the documentation provided by OpenStack or your operator for more information.
es: La implementación actual de Glance no soporta ell tipo de tarea %(task_type)s. Por favor consulte la documentación proporcionadapor OpenStack o a su operador para más información.
ko_kr: 이 작업 유형 %(task_type)s는 현재 배포된 Glance에서 지원되지 않습니다. 상세 정보는 오픈스택이나 운영자로부터 배포된 문서를 참조바랍니다.

source: To use --prefer_new or --overwrite you need to combine of these options with --merge option.
es: Para usar --prefer_new o reemplazar necesita combinar estas opciones con la opción --merge.
ko_kr: --prefer_new 또는 --overwrite를 사용하려면 --merge 옵션과 이 옵션을 결합해야 합니다.
zh_cn: 为了使用--prefer_new或者--overwrite，你需要将这些选项与--merge选项进行结合。

source: Unable to create image %s
es: No es posible crear imagen %s
ko_kr: 이미지 %s를 생성할 수 없음
zh_cn: 无法创建镜像 %s

source: Unable to create verifier since algorithm is unsupported: %(e)s
ko_kr: 알고리즘이 지원되지 않으므로 확인자를 생성할 수 없음: %(e)s

source: Unable to delete image %(image_id)s: %(e)s
ko_kr: 이미지 %(image_id)s을(를) 삭제할 수 없음 : %(e)s
zh_cn: 不能删除镜像 %(image_id)s:%(e)s

source: Unable to delete image %s
es: No es posible eliminar imagen %s
ko_kr: 이미지 %s를 삭제할 수 없음
zh_cn: 无法删除镜像%s

source: Unable to get images
es: No es posible obtener imágenes
ko_kr: 이미지를 가져올 수 없음
zh_cn: 无法获取镜像

source: Unable to kill image %(id)s:
es: No se puede matar imagen %(id)s:
ko_kr: 이미지 %(id)s 를 kill 할 수 없음:
zh_cn: 无法终止镜像 %(id)s:

source: Unable to load artifacts: %s
es: No se puede cargar artefactos: %s
ko_kr: 아티팩트를 로드할 수 없음: %s

source: Unable to restore artifact %(artifact_id)s: %(e)s
es: No se puede restaurar artefacto %(artifact_id)s: %(e)s
ko_kr: 아티팩트 %(artifact_id)s을(를) 복원할 수 없음: %(e)s
zh_cn: 不能修复构件 %(artifact_id)s:%(e)s

source: Unable to restore image %(image_id)s: %(e)s
es: No es posible restaurar imagen %(image_id)s: %(e)s
ko_kr: 이미지 %(image_id)s를 복구할 수 없음 : %(e)s
zh_cn: 不能还原镜像 %(image_id)s:%(e)s

source: Unable to retrieve certificate with ID %(id)s: %(e)s
ko_kr: ID가 %(id)s인 인증서를 검색할 수 없음: %(e)s

source: Unable to scrub image %(id)s from a location. Reason: %(exc)s
ko_kr: 위치에서 %(id)s 이미지를 삭제할 수 없습니다. 이유: %(exc)s
zh_cn: 不能清除某一位置的镜像 %(id)s。原因：%(exc)s

source: Unable to show image %s
es: No es posible mostrar imagen %s
ko_kr: 이미지 %s를 보여줄 수 없음
zh_cn: 无法显示镜像 %s

source: Unable to update image %s
es: No ha sido posible actualizar la imagen %s
ko_kr: 이미지 %s를 업데이트 할 수 없음
zh_cn: 无法更新镜像 %s

source: Unknown sort direction, must be 'desc' or 'asc'
es: Dirección de clasificación desconocida, debe ser 'desc' o ' asc'
ko_kr: 알 수 없는 정렬 방향입니다. 'desc' 또는 'asc'여야 함
zh_cn: 排序方向未知，必须为“降序”或“升序”

source: could not find %s
es: no se ha podido encontrar %s
ko_kr: %s 를 찾을 수 없음
zh_cn: 找不到 %s

source: swift config file %(conf_file)s:%(exc)s not found
es: No se encontró fichero de configuración de transferencia %(conf_file)s:%(exc)s
ko_kr: swift 구성 파일 %(conf_file)s:%(exc)s을(를) 찾을 수 없음
zh_cn: swift配置文件%(conf_file)s：%(exc)s未找到

source: Could not load plugin from %(module)s: %(msg)s
es: No se pudo cargar complemento de %(module)s: %(msg)s

source: Bad task configuration: %s
zh_cn: 错误的任务配置：%s

source: Task ID %(task_id)s failed. Error: %(exc_type)s: %(e)s
zh_cn: ID为%(task_id)s的任务失败。错误信息为：%(exc_type)s： %(e)s
