Repository: openstack/glance
Catalog: glance/locale/*/LC_MESSAGES/glance.po
Languages: es

source: Provided status of task is unsupported: %(status)s
es: No se soporta el estado de tarea proporcionado: %(status)s

source: Provided type of task is unsupported: %(type)s
es: No se soporta el tipo de tarea proporcionado: %(type)s

source: Provides a user friendly description of the namespace.
es: Proporciona una descripción sencilla del espacio de nombre.

source: Public images do not have members.
es: Las imágenes públicas no tienen miembros.

source: Public url to use for versions endpoint. The default is None, which will use the request's host_url attribute to populate the URL base. If Glance is operating behind a proxy, you will want to change this to represent the proxy's URL.
es: URL pública para usar para versiones endpoint. Por defecto es Ninguno, el cual utilizará el atributo host_url de la solicitud para poblar la base URL. Si Glance está operando tras un proxy, es posible que quiera cambiarla para representar la URL de proxy.

source: Python module path of data access API
es: La vía de acceso del módulo Python de la API de acceso a datos

source: Received invalid HTTP redirect.
es: Se ha recibido redirección HTTP no válida.

source: Redirecting to %(uri)s for authorization.
es: Redirigiendo a %(uri)s para la autorización.

source: Registry service can't use %s
es: El servicio de registro no puede usar %s

source: Registry was not configured correctly on API server. Reason: %(reason)s
es: El registro no se ha configurado correctamente en el servidor de API. Razón: %(reason)s

source: Relation %(name)s may not have multiple values
es: Es probable que la relación %(name)s no contenga valores múltiples

source: Reload of %(serv)s not supported
es: No se soporta la recarga de %(serv)s

source: Reloading %(serv)s (pid %(pid)s) with signal(%(sig)s)
es: Recargando %(serv)s (pid %(pid)s) con señal (%(sig)s)

source: Removing stale pid file %s
es: Eliminando fichero de identificación positiva obsoleto %s

source: Request body must be a JSON array of operation objects.
es: El cuerpo de la solicitud debe ser una matriz JSON de objetos de operación.

source: Request must be a list of commands
es: La solicitud debe ser una lista de comandos.

source: Required store %s is invalid
es: El almacén %s solicitado no es válido

source: Resource type names should be aligned with Heat resource types whenever possible: http://docs.openstack.org/developer/heat/template_guide/openstack.html
es: Los nombres de tipo de recurso beben alinearse con los tipos de recurso Heat en cualquier momento: http://docs.openstack.org/developer/heat/template_guide/openstack.html

source: Response from Keystone does not contain a Glance endpoint.
es: La respuesta de Keystone no contiene un punto final Glance.

source: Role used to identify an authenticated user as administrator.
es: El rol identificaba antes el usuario autenticado como administrador.

source: Run as a long-running process. When not specified (the default) run the scrub operation once and then exits. When specified do not exit and run scrub on wakeup_time interval as specified in the config.
es: Ejecución como un proceso de larga duración. Cuando no se especifique (por defecto), ejecuta la operación de depuración una vez y luego sale. Cuando se especifique no salga y ejecute depurador en intervalo wakeup_time como se especifica en la configuración.

source: Scope of image accessibility
es: Ámbito de accesibilidad de la imagen

source: Scope of namespace accessibility.
es: Alcance de accesibilidad del espacio de nombre.

source: Server %(serv)s is stopped
es: El servidor %(serv)s se ha detenido

source: Server worker creation failed: %(reason)s.
es: Se ha encontrado un error en la creación del trabajador de servidor: %(reason)s.

source: Set a system wide quota for every user. This value is the total capacity that a user can use across all storage systems. A value of 0 means unlimited.Optional unit can be specified for the value. Accepted units are B, KB, MB, GB and TB representing Bytes, KiloBytes, MegaBytes, GigaBytes and TeraBytes respectively. If no unit is specified then Bytes is assumed. Note that there should not be any space between value and unit and units are case sensitive.
es: Establezca una capacidad amplia del sistema para cada usuario. Este valor es la capacidad total que un usuario puede utilizar a lo largo de todos los sistemas de almacenamiento. Un valor de ero significa ilimitado. Se puede especificar una unidad opcional para el valor. La unidades que se aceptan son B, KB, MB, GB y TB representando respectivamente Bytes, KiloBytes, MegaBytes, GigaBytes y TeraBytes. Si no se espceifica unidad entonces se asume que son Bytes. Tenga en cuenta que no debe haber un espacio entre valor y unidad y las unidades distinguen mayúsculas.

source: Show level %(shl)s is not supported in this operation
es: No se soporta el nivel de vista %(shl)s en esta operación

source: Size of image file in bytes (READ-ONLY)
es: Tamaño de fichero de imagen en bytes (SOLO-LECTURA)

source: Some resource types allow more than one key / value pair per instance. For example, Cinder allows user and image metadata on volumes. Only the image properties metadata is evaluated by Nova (scheduling or drivers). This property allows a namespace target to remove the ambiguity.
es: Algunos tipos de recurso aceptan más de una clave / par de valor por instancia. Por ejemplo, Cinder permite metadatos de usuario e imagen en volúmenes. Nova solo evalúa los metadatos de propiedades de imagen (planeadores y controladores). Esta propiedad permite un espacio de nombre para eliminar la ambigüedad.

source: Sort direction supplied was not valid.
es: La dirección de ordenación proporcionada no es válida.

source: Sort key supplied was not valid.
es: La clave de clasificación proporcionada no es válida.

source: Specifies the prefix to use for the given resource type. Any properties in the namespace should be prefixed with this prefix when being applied to the specified resource type. Must include prefix separator (e.g. a colon :).
es: Especifica el prefijo que se usará para el tipo de recurso dado. Cualquier propiedad en el espacio de nombre deben tener este prefijo cuando se aplica al tipo de recurso especificado. Debe incluir separador de prefijo(por ejemplo un punto :).

source: Specifies which task executor to be used to run the task scripts.
es: Especifica cual ejecutor de tarea se usará para ejecutar los scripts de tarea.

source: Status must be "pending", "accepted" or "rejected".
es: el estado debe ser "pending", "accepted" o "rejected".

source: Status not specified
es: Estado no especificado

source: Status of the image (READ-ONLY)
es: Estado de la imagen (SOLO-LECTURA)

source: Status transition from %(cur_status)s to %(new_status)s is not allowed
es: No se permite la transición de %(cur_status)s a %(new_status)s

source: Stopping %(serv)s (pid %(pid)s) with signal(%(sig)s)
es: Deteniendo %(serv)s (pid %(pid)s) con señal (%(sig)s)

source: Store for image_id not found: %s
es: No se ha encontrado el almacenamiento para image_id: %s

source: Store for scheme %s not found
es: El almacén para el esquema %s no se ha encontrado

source: Supplied %(attr)s (%(supplied)s) and %(attr)s generated from uploaded image (%(actual)s) did not match. Setting image status to 'killed'.
es: %(attr)s (%(supplied)s) y %(attr)s proporcionados que se han generado desde la imagen cargada (%(actual)s) no coinciden. Definiendo estado de imagen como 'killed'.

source: Supported values for the 'container_format' image attribute
es: Valores para el atributo de imagen 'container_format' soportados

source: Supported values for the 'disk_format' image attribute
es: Valores para el atributo de imagen 'disk_format' soportados

source: Suppressed respawn as %(serv)s was %(rsn)s.
es: Se suprimió respawn como %(serv)s era %(rsn)s.

source: System SIGHUP signal received.
es: Se ha recibido señal de sistema SIGHUP.

source: Task '%s' is required
es: Se necesita tarea '%s'

source: Task does not exist
es: La tarea no existe

source: Task failed due to Internal Error
es: La tarea ha fallado a causa de un Error Interno

source: Task was not configured properly
es: La tarea no se configuró correctamente

source: Task with the given id %(task_id)s was not found
es: No se encontró tarea con id %(task_id)s proporcionado

source: The "changes-since" filter is no longer available on v2.
es: El filtro "changes-since" ya no está disponible en v2.

source: The CA file you specified %s does not exist
es: El archivo CA %s que ha especificado no existe

source: The Image %(image_id)s object being created by this task %(task_id)s, is no longer in valid status for further processing.
es: El objeto de imagen %(image_id)s que la tarea %(task_id)s está creando, ya no tiene un estado válido para un próximo procesamiento.

source: The Store URI was malformed.
es: El URI del almacén tenía un formato incorrecto.

source: The URL to the keystone service. If "use_user_token" is not in effect and using keystone auth, then URL of keystone can be specified.
es: La URL al servicio de keystone. Si "use_user_token" no tiene efecto y usa keystone auth, entonces se puede especificar la URL de keystone.

source: The address where the Swift authentication service is listening.(deprecated)
es: La dirección en donde el servicio de autenticación Swift es escuchado (rechazado)

source: The administrators password. If "use_user_token" is not in effect, then admin credentials can be specified.
es: La contraseña de los administradores. Si "use_user_token" no tiene efecto, entonces se puede especificar las credenciales del administrador.

source: The administrators user name. If "use_user_token" is not in effect, then admin credentials can be specified.
es: El nombre de usuario del administrador. Si "use_user_token" no tiene efecto, entonces se pueden especificar las credenciales del administrador.

source: The amount of time in seconds to delay before performing a delete.
es: El lapso e tiempo en segundos en demora antes de realizar una eliminación.

source: The amount of time to let an image remain in the cache without being accessed.
es: El periodo de tiempo para dejar que una imagen permanezca en la memoria caché sin que se acceda a ella.

source: The backlog value that will be used when creating the TCP listener socket.
es: El valor acumulado que se utilizará al crear la pila TCP de escucha.

source: The cert file you specified %s does not exist
es: El archivo de certificado que ha especificado %s no existe

source: The config file that has the swift account(s)configs.
es: El fichero de configuración que tiene las configuraciones de cuenta(s) swift.

source: The current status of this task
es: El estado actual de esta tarea

source: The device housing the image cache directory %(image_cache_dir)s does not support xattr. It is likely you need to edit your fstab and add the user_xattr option to the appropriate line for the device housing the cache directory.
es: El dispositivo que aloja el directorio de caché de imágenes %(image_cache_dir)s no soporta xattr. Es probable que tenga que editar fstab y añadir la poción user_xattr en la línea adecuada para que el dispositivo aloje el directorio de caché.

source: The driver to use for image cache management.
es: El controlador que se usará para la administración del caché de imagen.

source: The format to which images will be automatically converted.
es: El formato al cual las imágenes se convertirán automaticamente.

source: The given uri is not valid. Please specify a valid uri from the following list of supported uri %(supported)s
es: El uri proporcionado no es válido. Por favor especifique un uri válido de la siguiente lista de uri soportados %(supported)s

source: The hostname/IP of the pydev process listening for debug connections
es: El nombre de host o la IP del proceso pydev que escucha las conexiones de depuración

source: The image %s is already present on the slave, but our check for it did not find it. This indicates that we do not have permissions to see all the images on the slave server.
es: La imagen %s ya se encuentra en el esclavo, pero no se encontró validación para esta. Esto indica que no tenemos permiso para ver todas las imágenes en el servidor esclavo.

source: The incoming image is too large: %s
es: La imagen de entrada es demasiado grande: %s

source: The key file you specified %s does not exist
es: El archivo de claves que ha especificado %s no existe

source: The limit has been exceeded on the number of allowed image locations. Attempted: %(attempted)s, Maximum: %(maximum)s
es: Se ha excedido el límite en el número permitido para ubicaciones de imagen. Intento: %(attempted)s, Máximo: %(maximum)s

source: The limit has been exceeded on the number of allowed image members for this image. Attempted: %(attempted)s, Maximum: %(maximum)s
es: Se ha excedido el límite en el número de miembros de imagen para esta imagen. Intentos: %(attempted)s, Máximo: %(maximum)s

source: The limit has been exceeded on the number of allowed image properties. Attempted: %(attempted)s, Maximum: %(maximum)s
es: Se ha excedido el límite en el número permitido para propiedades de imagen. Intento: %(attempted)s, Máximo: %(maximum)s

source: The limit has been exceeded on the number of allowed image properties. Attempted: %(num)s, Maximum: %(quota)s
es: Se ha excedido el límite en el número de propiedades de imagen permitidas. Intentos: %(num)s, Máximo: %(quota)s

source: The limit has been exceeded on the number of allowed image tags. Attempted: %(attempted)s, Maximum: %(maximum)s
es: Se ha excedido el límite en el número permitido para etiquetas de imagen. Intento: %(attempted)s, Máximo: %(maximum)s

source: The location %(location)s already exists
es: Ya existe la ubicación %(location)s

source: The location data has an invalid ID: %d
es: Los datos de ubicación contienen un ID no válido: %d

source: The location of the property protection file.This file contains the rules for property protections and the roles/policies associated with it. If this config value is not specified, by default, property protections won't be enforced. If a value is specified and the file is not found, then the glance-api service will not start.
es: La ubicación del fichero de protección de propiedad. Este fichero contiene las normas para las protecciones de propiedad y roles/políticas asociadas a éste. Si no se especifica este valor de configuración, por defecto, las protecciones de propiedad no tendrán efecto. Si se especifica un valor y no se encuentra el fichero, entonces el servicio glance-api no iniciará.

source: The metadata definition %(record_type)s with name=%(record_name)s not deleted. Other records still refer to it.
es: No se borró la definición de metadatos%(record_type)s de nombre=%(record_name)s- Otros archivos aún se refieren a ésta.

source: The metadata definition namespace=%(namespace_name)s already exists.
es: Ya existe el espacio de nombre para definición de metadatos=%(namespace_name)s

source: The metadata definition object with name=%(object_name)s was not found in namespace=%(namespace_name)s.
es: No se encontró el objeto para definición de metadatos de nombre=%(object_name)s en espacio de nombre=%(namespace_name)s.

source: The metadata definition property with name=%(property_name)s was not found in namespace=%(namespace_name)s.
es: No se encontró la propiedad para definición de metadatos de nombre=%(property_name)s en espacio de nombre=%(namespace_name)s.

source: The metadata definition resource-type association of resource-type=%(resource_type_name)s to namespace=%(namespace_name)s already exists.
es: Ya existe la asociación de tipo de recurso del tipo de recurso=%(resource_type_name)s para el espacio de nombre=%(namespace_name)s.

source: The metadata definition resource-type association of resource-type=%(resource_type_name)s to namespace=%(namespace_name)s, was not found.
es: No se encontró la asociación de tipo de recurso del tipo de recurso para definición de metadatos=%(resource_type_name)s para el espacio de nombre=%(namespace_name)s.

source: The metadata definition resource-type with name=%(resource_type_name)s, was not found.
es: No se encontró el tipo de recurso para definición de metadatos de nombre=%(resource_type_name)s

source: The metadata definition tag with name=%(name)s was not found in namespace=%(namespace_name)s.
es: No se encontró la etiqueta para definición de metadatos de nombre=%(name)s en el espacio de nombre=%(namespace_name)s.

source: The mode in which the engine will run. Can be 'serial' or 'parallel'.
es: El modo en el cual se ejecutará el motor. Puede ser 'serial' o 'paralelo'

source: The number of child process workers that will be created to service requests. The default will be equal to the number of CPUs available.
es: El número de trabajadores en procesos hijo que se creará para solicitudes de servicio. El número por defecto será igual al de CPUs disponibles.

source: The number of parallel activities executed at the same time by the engine. The value can be greater than one when the engine mode is 'parallel'.
es: La cantidad de actividades paralelas que el motor ejecuta al mismo tiempo. El valor puede ser mayor a uno cuando el motor está en modo 'paralelo'.

source: The parameters required by task, JSON blob
es: Los parámetros requeridos por tarea, objeto JSON

source: The path to the cert file to use in SSL connections to the registry server, if any. Alternately, you may set the GLANCE_CLIENT_CERT_FILE environment variable to a filepath of the CA cert file
es: La ruta al fichero de certificado para usar en conexiones SSL al servidor de registro, si existe. Alternativamente, puede establecer la variable de ambiente GLANCE_CLIENT_CERT_FILE a una ruta de fichero del fichero de certificado CA

source: The path to the certifying authority cert file to use in SSL connections to the registry server, if any. Alternately, you may set the GLANCE_CLIENT_CA_FILE environment variable to a filepath of the CA cert file.
es: La ruta al fichero de certificado de la autoridad que certifica para usar en conexiones SSL al servidor de registro, si existe. Alternativamente, puede establecer la variable de ambiente GLANCE_CLIENT_CA_FILE a una ruta de fichero del fichero de certificado CA

source: The path to the key file to use in SSL connections to the registry server, if any. Alternately, you may set the GLANCE_CLIENT_KEY_FILE environment variable to a filepath of the key file
es: La ruta al fichero de clave para usar conexiones SSL al servidor de registro, si lo hay. Alternativamente, puede establecer la variable de ambiente GLANCE_CLIENT_KEY_FILE a una ruta de fichero del fichero de clave

source: The path to the sqlite file database that will be used for image cache management.
es: La ruta a la base de datos de fichero de SQLite que se usará para la administración del caché de imagen.

source: The period of time, in seconds, that the API server will wait for a registry request to complete. A value of 0 implies no timeout.
es: El periodo de tiempo, en segundos, que el servidor API esperará para que se complete una solicitud de registro. Un valor de 0 implica que no hay tiempo de espera.

source: The port on which a pydev process is listening for connections.
es: El puerto en el que un proceso pydev escucha las conexiones.

source: The port on which the server will listen.
es: El puerto en el cual el servidor escuchará.

source: The protocol to use for communication with the registry server. Either http or https.
es: El protocolo a usar para la comunicación con el servidor de registro. Http o https.

source: The provided body %(body)s is invalid under given schema: %(schema)s
es: El cuerpo %(body)s proporcionado no es válido bajo el esquema : %(schema)s

source: The provided image is too large.
es: La imagen proporcionada es demasiado grande.

source: The provided path '%(path)s' is invalid: %(explanation)s
es: La ruta '%(path)s' proporcioanda no es válida: %(explanation)s

source: The reference to the default swift account/backing store parameters to use for adding new images.
es: La referencia para los parámetros de cuenta swift/almacén de respaldo por defecto utilizada para agregar nuevas imágenes.

source: The region for the authentication service. If "use_user_token" is not in effect and using keystone auth, then region name can be specified.
es: La región para el servicio de autenticación. Si "use_user_token" no tiene efecto y utiliza keystone auth, entonces se puede especificar el nombre de la región.

source: The request returned 500 Internal Server Error.
es: La solicitud ha devuelto el mensaje 500 Error interno del servidor.

source: The request returned 503 Service Unavailable. This generally occurs on service overload or other transient outage.
es: La solicitud ha devuelto un error 503 Servicio no disponible. Esto sucede generalmente por una sobrecarga del servicio o una interrupción transitoria.

source: The request returned a 302 Multiple Choices. This generally means that you have not included a version indicator in a request URI. The body of response returned: %(body)s
es: La solicitud ha devuelto un 302 Múltiples opciones. Generalmente esto significa que no se ha incluido un indicador de versión en un URI de solicitud. El cuerpo de la respuesta devuelta: %(body)s

source: The request returned a 413 Request Entity Too Large. This generally means that rate limiting or a quota threshold was breached. The response body: %(body)s
es: La solicitud ha devuelto un error 413 Entidad de solicitud demasiado grande. Esto generalmente significa que se ha infringido el límite de índice o un umbral de cuota. El cuerpo de la respuesta: %(body)s

source: The request returned an unexpected status: %(status)s. The response body: %(body)s
es: La solicitud ha devuelto un estado inesperado: %(status)s. El cuerpo de la respuesta: %(body)s

source: The requested image has been deactivated. Image data download is forbidden.
es: Se ha desactivado la imagen solicitada. Se prohíbe la descarga de datos de imagen.

source: The result of current task, JSON blob
es: El resultado de la tarea, objeto JSON actual

source: The size of the data %(image_size)s will exceed the limit. %(remaining)s bytes remaining.
es: El tamaño de los datos %(image_size)s excederá el límite. Quedan %(remaining)s bytes

source: The specified member %s could not be found
es: No se pudo encontrar el miembro %s especificado

source: The specified metadata object %s could not be found
es: No se pudo encontrar el objeto de metadatos %s especificado

source: The specified metadata tag %s could not be found
es: No se pudo encontrar la etiqueta de metadatos %s especificada

source: The specified namespace %s could not be found
es: No se ha podido encontrar el espacio de nombre %s especificado

source: The specified property %s could not be found
es: No se pudo encontrar la propiedad %s especificada

source: The specified resource type %s could not be found
es: No se pudo encontrar el tipo de recurso %s especificado

source: The status of deleted image location can only be set to 'pending_delete' or 'deleted'
es: El estado de la ubicación de la imagen eliminada solo se puede establecer como 'pending_delete' o 'deleted'.

source: The status of deleted image location can only be set to 'pending_delete' or 'deleted'.
es: El estado de la ubicación de imagen eliminada solo se puede establecer como 'pending_delete' o 'deleted'.

source: The status of this image member
es: El estado de este miembro de la imagen
