Repository: openstack/glance
Catalog: glance/locale/*/LC_MESSAGES/glance.po
Languages: es

source: The store names to use to get store preference order. The name must be registered by one of the stores defined by the 'stores' config option. This option will be applied when you using 'store_type' option as image location strategy defined by the 'location_strategy' config option.
es: Los nombres de almacén a usar para obtener orden de preferencia de almacenamiento. El nombre se debe registrar por uno de los almacenes definidos por la opción de configuración 'stores'. Esta opción se aplicará cuando se use la opción 'store_type' como estrategia de ubicación de imagen definida por la opción de configuración 'location_strategy'.

source: The strategy to use for authentication. If "use_user_token" is not in effect, then auth strategy can be specified.
es: La estrategia a usar para la autenticación. SI "use_user_token" no tiene efecto, entonces, se puede especificar la estrategia auth.

source: The target member %(member_id)s is already associated with image %(image_id)s.
es: El miembro meta %(member_id)s ya está asociado con la imagen %(image_id)s.

source: The tenant name of the administrative user. If "use_user_token" is not in effect, then admin tenant name can be specified.
es: El nombre global del usuario de administrador. Si "use_user_token" no tiene efecto, entonces se puede especificar el nombre global del administrador.

source: The type of task represented by this content
es: El tipo de tarea representada por este contenido

source: The unique namespace text.
es: EL único texto de espacio de nombre.

source: The upper limit (the maximum size of accumulated cache in bytes) beyond which pruner, if running, starts cleaning the images cache.
es: El límite superior (el tamaño máximo de caché acumulado en bytes) más allá del cual el podador, si se está ejecutando, comienza a limpiar el caché de imágenes.

source: The user friendly name for the namespace. Used by UI if available.
es: El nombre fácil de usar para el espacio de nombre. Utilizado por UI si está disponible.

source: The user to authenticate against the Swift authentication service (deprecated)
es: El usuario para autenticar con relación al servicio de autenticación Swift (rechazar)

source: The value for the socket option TCP_KEEPIDLE. This is the time in seconds that the connection must be idle before TCP starts sending keepalive probes.
es: El valor de la opción de pila TCP_KEEPIDLE. Es el tiempo en segundos que debe estar la conexión inactiva antes de que TCP comience a enviar sondas keepalive.

source: There is a problem with your %(error_key_name)s %(error_filename)s. Please verify it. Error: %(ioe)s
es: Hay un problema con %(error_key_name)s %(error_filename)s. Por favor verifique. Error: %(ioe)s

source: There is a problem with your %(error_key_name)s %(error_filename)s. Please verify it. OpenSSL error: %(ce)s
es: Hay un problema con %(error_key_name)s %(error_filename)s. Por favor verifique. Error OpenSSL: %(ce)s

source: There is a problem with your key pair. Please verify that cert %(cert_file)s and key %(key_file)s belong together. OpenSSL error %(ce)s
es: Hay un problema con el par de claves. Por favor verifique que el certificado %(cert_file)s y clave %(key_file)s deben estar juntas. Error OpenSSL %(ce)s

source: There was an error configuring the client.
es: Se ha producido un error al configurar el cliente.

source: There was an error connecting to a server
es: Se ha producido un error al conectar a un servidor

source: This config value indicates whether "roles" or "policies" are used in the property protection file.
es: Este valor de configuración indica si se usan los "roles" o "políticas" en el fichero de protección de propiedad.

source: This operation is currently not permitted on Glance Tasks. They are auto deleted after reaching the time based on their expires_at property.
es: Actualmente no se permite esta operación en las tareas Glance. Se eliminarán automáticamente después de alcanzar el tiempo con base en expires_at property.

source: This operation is currently not permitted on Glance images details.
es: Actualmente no se permite la operación en los detalles de imagen de Glance.

source: This value sets what strategy will be used to determine the image location order. Currently two strategies are packaged with Glance 'location_order' and 'store_type'.
es: Este valor establece la estrategia que se empleará para determinar el orden de ubicación de la imagen. Actualmente hay 2 estrategias empaquetadas con Glance 'location_order' y 'store_type'.

source: Time in hours for which a task lives after, either succeeding or failing
es: Tiempo de vida en horas para la tarea, así tenga éxito o fracase

source: Timeout for client connections' socket operations. If an incoming connection is idle for this number of seconds it will be closed. A value of '0' means wait forever.
es: Tiempo de espera para las operaciones de conexión de pila del cliente. Si una conexión entrante está inactiva para este número de segundos se cerrará. Un valor de '0' significa esperar permanentemente.

source: Too few arguments.
es: Muy pocos argumentos.

source: Too few locations
es: Hay muy pocas ubicaciones

source: Too many locations
es: Hay demasiadas ubicaciones

source: Total size is %(size)d bytes across %(img_count)d images
es: El tamaño total de los bytes es %(size)d a lo largo de las imágenes %(img_count)d

source: Turn on/off delayed delete.
es: Encender/apagar eliminación retrasada.

source: Type version has to be a valid semver string
es: La versión del tipo debe se una secuencia semver válida

source: URI cannot contain more than one occurrence of a scheme.If you have specified a URI like swift://user:pass@http://authurl.com/v1/container/obj, you need to change it to use the swift+http:// scheme, like so: swift+http://user:pass@authurl.com/v1/container/obj
es: El URI no puede contener más de una aparición de un esquema. Si ha especificado un URI como swift://user:pass@http://authurl.com/v1/container/obj, tiene que cambiarlo para que utilice el esquema swift+http://, como: swift+http://user:pass@authurl.com/v1/container/obj

source: URL to access the image file kept in external store (READ-ONLY)
es: La URL para acceder al ficherode imagen se encuentra en almacén externo (SOLO-LECTURA)

source: Unable to PUT to non-empty collection
es: No es posible COLOCAR a una colección no vacía

source: Unable to create pid file %(pid)s. Running as non-root? Falling back to a temp file, you can stop %(service)s service using: %(file)s %(server)s stop --pid-file %(fb)s
es: No se puede crear fichero pid %(pid)s. ¿Ejecutar como non-root? Retrocediendo a fichero temporal, puede detener el uso de servicio %(service)s: %(file)s %(server)s detener--fichero-pid %(fb)s

source: Unable to filter on a range with a non-numeric value.
es: No se ha podido filtrar en un rango con un valor no numérico.

source: Unable to filter using the specified range.
es: No se ha podido filtrar mediante el rango especificado.

source: Unable to find '%s' in JSON Schema change
es: No se ha podido encontrar '%s' en el cambio del esquema JSON

source: Unable to find `op` in JSON Schema change. It must be one of the following: %(available)s.
es: No es posible encontrar `op` en cambio de JSON Schema. Debe ser uno de los siguientes: %(available)s.

source: Unable to get legacy image
es: No se logró obtener herencia de imagen

source: Unable to increase file descriptor limit. Running as non-root?
es: No se puede aumentar el límite de descripción de fichero ¿Desea ejecutar como non-root?

source: Unable to load %(app_name)s from configuration file %(conf_file)s. Got: %(e)r
es: No se ha podido cargar %(app_name)s desde el archivo de configuración %(conf_file)s. Se ha obtenido: %(e)r

source: Unable to load schema: %(reason)s
es: No se ha podido cargar el esquema: %(reason)s

source: Unable to locate paste config file for %s.
es: No se puede ubicar el fichero de configuración de pegado para %s.

source: Unable to modify collection in immutable or readonly property
es: No se puede modificar recolección en una propiedad no permutable o de solo lectura

source: Unable to retrieve request id from context
es: No se ha podido recuperar el ID de solicitud del contexto

source: Unable to specify artifact type explicitly
es: No se puede especificar el tipo de artefacto de manera explícita

source: Unable to specify artifact type version explicitly
es: No se puede especificar la versión del tipo de artefacto de manera explícita

source: Unable to specify version if multiple types are possible
es: No es posible especificar la versión si se pueden múltiples tipos

source: Unable to specify version if type is not specified
es: No es posible especificar la versión si no se especifica el tipo

source: Unable to upload duplicate image data for image%(image_id)s: %(error)s
es: No se puede cargar datos de imagen duplicada %(image_id)s: %(error)s

source: Unauthorized image access
es: Acceso a imagen no autorizado

source: Unexpected response: %s
es: Respuesta inesperada : %s

source: Unknown auth strategy '%s'
es: Estrategia de autenticación desconocida '%s'

source: Unknown command: %s
es: Comando desconocido %s

source: Unknown sort direction, must be 'desc' or 'asc'
es: Dirección de clasificación desconocida, debe ser 'desc' o ' asc'

source: Unrecognized JSON Schema draft version
es: Versión de borrador de esquema JSON no reconocida

source: Unrecognized changes-since value
es: Valor de changes-since no reconocido

source: Unsupported sort_dir. Acceptable values: %s
es: sort_dir no soportado. Valores aceptables: %s

source: Unsupported sort_key. Acceptable values: %s
es: sort_key no soportado. Valores aceptables: %s

source: Value %(value)d out of range, must not exceed %(max)d
es: Valor %(value)d fuera de rango, no debe exceder %(max)d

source: Value is greater than maximum
es: El valor es mayor que el máximo

source: Value is less than minimum
es: El valor es menor que el mínimo

source: Value is required
es: Se necesita valor

source: Version component is too large (%d max)
es: EL componente de versión es demasiado largo %d máx)

source: Version is invalid: %(reason)s
es: Versión no válida: %(reason)s

source: Virtual size of image in bytes (READ-ONLY)
es: Tamaño virtuañ de la imagen en bytes (SOLO-LECTURA)

source: Visibility must be either "public" or "private"
es: La visibilidad debe ser "pública" o "privada"

source: Waited 15 seconds for pid %(pid)s (%(file)s) to die; giving up
es: Se esperó 15 segundos para que pid %(pid)s (%(file)s) muriera; desistiendo

source: When false, no artifacts can be loaded regardless of available_plugins. When true, artifacts can be loaded.
es: SI es false, ningún artefacto se puede cargar sin importar los available_plugins. Si es true, se pueden cargar los artefactos

source: When running server in SSL mode, you must specify both a cert_file and key_file option value in your configuration file
es: Al ejecutar el servidor en modalidad SSL, debe especificar un valor para las opciones cert_file y key_file en el archivo de configuración

source: When true, this option sets the owner of an image to be the tenant. Otherwise, the owner of the image will be the authenticated user issuing the request.
es: Cuando aplica, esta opción establece al propietario de una imagen como usuario. De otro modo, el propietario de la imagen será el usuario autenticado que emite la solicitud.

source: When using SSL in connections to the registry server, do not require validation via a certifying authority. This is the registry's equivalent of specifying --insecure on the command line using glanceclient for the API.
es: No se requiere validación vía una autoridad que certifica si se usa SSL en conexiones al servidor de registro. Este es el equivalente del registro a especificar --inseguro en la línea de comando usando glanceclient para el API.

source: Whether to allow users to specify image properties beyond what the image schema provides
es: Si se permite que los usuarios especifiquen las propiedades de la imagen más allá de lo que proporciona el esquema de la imagen

source: Whether to include the backend image locations in image properties. For example, if using the file system store a URL of "file:///path/to/image" will be returned to the user in the 'direct_url' meta-data field. Revealing storage location can be a security risk, so use this setting with caution! The overrides show_image_direct_url.
es: SI incluir o no ubicaciones de imagen back-end en las propiedades de imagen. Por ejemplo, si se utiliza una URL de "file:///path/to/image" en el almacén se sistema de fichero volverá al usuario en el campo de mera datos 'direct_url'. Revelar la ubicación de almacenamiento puede ser un riesgo, por esto ¡use la configuración con precaución! La anulación how_image_direct_url.

source: Whether to include the backend image storage location in image properties. Revealing storage location can be a security risk, so use this setting with caution!
es: Si incluir o no la ubicación de almacenamiento de la imagen del programa de fondo en las propiedades de la imagen. Revelar la ubicación de almacenamiento puede ser un riesgo de seguridad, así que este valor debe utilizarse con precaución.

source: Whether to pass through headers containing user and tenant information when making requests to the registry. This allows the registry to use the context middleware without keystonemiddleware's auth_token middleware, removing calls to the keystone auth service. It is recommended that when using this option, secure communication between glance api and glance registry is ensured by means other than auth_token middleware.
es: Si se debe o no pasar a través de las cabeceras que contienen usuario e información de tenencia cuando se hacen solicitudes al registro. Esto permite que el registro use el contexto middleware sin el auth_token middleware de keystonemiddleware, eliminando llamadas al servicio de keystone auth. Se recomienda que cuando se utilice esta opción, se garantice que la comunicación segura entre glance api y el registro glance por medio de un middleware diferente a auth_token.

source: Whether to pass through the user token when making requests to the registry. To prevent failures with token expiration during big files upload, it is recommended to set this parameter to False.If "use_user_token" is not in effect, then admin credentials can be specified.
es: Si se debe o no pasar a través del token del usuario cuando se hacen solicitudes al registro. Para prevenir fallas con la expiración del token durante la carga de ficheros grandes, se recomienda configurar este parámetro en False. Si "use_user_token" no tiene efecto, entonces se pueden especificar credenciales de administración.

source: Work dir for asynchronous task operations. The directory set here will be used to operate over images - normally before they are imported in the destination store. When providing work dir, make sure enough space is provided for concurrent tasks to run efficiently without running out of space. A rough estimation can be done by multiplying the number of `max_workers` - or the N of workers running - by an average image size (e.g 500MB). The image size estimation should be done based on the average size in your deployment. Note that depending on the tasks running you may need to multiply this number by some factor depending on what the task does. For example, you may want to double the available size if image conversion is enabled. All this being said, remember these are just estimations and you should do them based on the worst case scenario and be prepared to act in case they were wrong.
es: Directorio de trabajo para operaciones de tarea asincrónica. El directorio configurado aquí se usará para operar sobre imágenes - normalmente antes de que sean importadas en el almacén de destino. Si proporciona un directorio de trabajo, asegúrese de que se está proporcionado suficiente espacio para que las tareas concurrentes se ejecuten eficientemente sin quedarse sin espacio. Se puede hacer una estimación aproximada al multiplicar el número de `max_workers` - o N trabajadores ejecutando - por un tamaño promedio de imagen (por ejemplo 500MB). La estimación del tamaño de imagen se debe hacer con base en el tamaño promedio en su implementación. Tenga en cuenta que dependiendo de la tarea que se ejecute pude necesitar multiplicar este número por algún factor dependiendo de lo que hace la tarea. Por ejemplo, va querer duplicar el tamaño disponible si se permite la conversión de imagen. Ahora que se dijo esto, recuerde que estas son solo estimaciones y debe hacerlas con base en el peor de los casos y estar listo para actuar en caso de que estén mal.

source: Wrong command structure: %s
es: Estructura de comando incorrecta: %s

source: You are not authenticated.
es: No está autenticado.

source: You are not authorized to complete this action.
es: No está autorizado a completar esta acción.

source: You are not permitted to create a tag in the namespace owned by '%s'
es: No tiene permiso para crear etiqueta en el espacio de nombre propiedad de '%s'

source: You are not permitted to create image members for the image.
es: No tiene permiso para crear miembros de imagen para la imagen.

source: You are not permitted to create images owned by '%s'.
es: No tiene permiso para crear imágenes propiedad de '%s'.

source: You are not permitted to create namespace owned by '%s'
es: No tiene permiso para crear espacio de nombre propiedad de '%s'

source: You are not permitted to create object owned by '%s'
es: No tiene permiso para crear objeto propiedad de '%s'

source: You are not permitted to create property owned by '%s'
es: No tiene permiso para crear propiedad perteneciente a'%s'

source: You are not permitted to create resource_type owned by '%s'
es: No tiene permiso para crear resource_type propiedad de '%s'

source: You are not permitted to create this task with owner as: %s
es: No tiene permiso para crear esta tarea como propiedad de: '%s

source: You are not permitted to delete this image.
es: No tiene permiso para suprimir esta imagen.

source: You are not permitted to delete this meta_resource_type.
es: No tiene permiso para eliminar este meta_resource_type.

source: You are not permitted to delete this namespace.
es: No tiene permiso para eliminar este espacio de nombre.

source: You are not permitted to delete this object.
es: No tiene permiso para eliminar este objeto.

source: You are not permitted to delete this property.
es: No tiene permiso para eliminar esta propiedad.

source: You are not permitted to delete this tag.
es: No tiene permiso para eliminar esta etiqueta.

source: You are not permitted to modify '%(attr)s' on this %(resource)s.
es: No tiene permiso para modificar '%(attr)s' en este %(resource)s.

source: You are not permitted to modify '%s' on this image.
es: No tiene permiso para modificar '%s' en esta imagen.

source: You are not permitted to modify locations for this image.
es: No tiene permiso para modificar ubicaciones para esta imagen.

source: You are not permitted to modify tags on this image.
es: No tiene permiso para modificar etiquetas en esta imagen.

source: You are not permitted to modify this image.
es: No tiene permiso para modificar esta imagen.

source: You are not permitted to set status on this task.
es: No tiene permiso para configurar estado en esta tarea.

source: You are not permitted to update this namespace.
es: No tiene permiso para actualizar este espacio de nombre.

source: You are not permitted to update this object.
es: No tiene permiso para actualizar este objeto.

source: You are not permitted to update this property.
es: No tiene permiso para actualizar esta propiedad.

source: You are not permitted to update this tag.
es: No tiene permiso para actualizar esta etiqueta.

source: You are not permitted to upload data for this image.
es: No tiene permiso para cargar datos para esta imagen.

source: You cannot add image member for %s
es: No se puede añadir el miembro de la imagen para %s

source: You cannot delete image member for %s
es: No se puede suprimir el miembro de la imagen para %s

source: You cannot get image member for %s
es: No se puede obtener el miembro de la imagen para %s

source: You cannot update image member %s
es: No se puede actualizar el miembro de la imagen %s

source: You do not own this image
es: No es propietario de esta imagen

source: You have selected to use SSL in connecting, and you have supplied a cert, however you have failed to supply either a key_file parameter or set the GLANCE_CLIENT_KEY_FILE environ variable
es: Ha seleccionado utilizar SSL en la conexión y ha proporcionado un certificado, pero no ha proporcionado un parámetro key_file ni ha definido la variable de entorno GLANCE_CLIENT_KEY_FILE

source: You have selected to use SSL in connecting, and you have supplied a key, however you have failed to supply either a cert_file parameter or set the GLANCE_CLIENT_CERT_FILE environ variable
es: Ha seleccionado utilizar SSL en la conexión y ha proporcionado una clave, pero no ha proporcionado un parámetro cert_file ni ha definido la variable de entorno GLANCE_CLIENT_CERT_FILE

source: __init__() got unexpected keyword argument '%s'
es: __init__() obtuvo un argumento de búsqueda inesperado '%s'

source: cannot transition from %(current)s to %(next)s in update (wanted from_state=%(from)s)
es: No se puede pasar de %(current)s a %(next)s en la actualización (se desea from_state=%(from)s)

source: custom properties (%(props)s) conflict with base properties
es: las propiedades personalizadas (%(props)s) están en conflicto con las propiedades base

source: eventlet 'poll' nor 'selects' hubs are available on this platform
es: Los concentradores de 'sondeo' y los de 'selección' no están disponibles en esta plataforma

source: is_public must be None, True, or False
es: is_public debe ser None, True o False

source: limit param must be an integer
es: el parámetro de límite debe ser un entero

source: limit param must be positive
es: el parámetro de límite debe ser positivo

source: location: %s data lost
es: se han perdido los datos de ubicación: %s

source: md5 hash of image contents. (READ-ONLY)
es: md5 hash de contenidos de imagen. (SOLO-LECTURA)

source: new_image() got unexpected keywords %s
es: new_image() obtuvo argumentos de búsqueda inesperados %s

source: protected must be True, or False
es: protected debe ser True o False

source: unable to launch %(serv)s. Got error: %(e)s
es: No se puede iniciar %(serv)s. Se ha obtenido error: %(e)s
