Repository: openstack/glance
Catalog: glance/locale/*/LC_MESSAGES/glance.po
Languages: es

source: %(attribute)s have to be string
es: %(attribute)s debe ser una secuencia

source: %(attribute)s is required
es: se necesita %(attribute)s

source: %(attribute)s may not be longer than %(length)i
es: %(attribute)s no debe ser más larga que %(length)i

source: %(attribute)s may not be shorter than %(length)i
es: %(attribute)s no debe ser más corto que %(length)i

source: %(attribute)s should match pattern %(pattern)s
es: %(attribute)s debe coincidir con el patrón %(pattern)s

source: %(cls)s exception was raised in the last rpc call: %(val)s
es: Ocurrió excepción %(cls)s en la última llamada a rpc: %(val)s

source: %(serv)s (pid %(pid)s) is running...
es: Se esta ejecutando %(serv)s (pid %(pid)s) ...

source: %(serv)s appears to already be running: %(pid)s
es: Parece que %(serv)s ya se está ejecutando: %(pid)s

source: %(strategy)s is registered as a module twice. %(module)s is not being used.
es: %(strategy)s está registrado como módulo dos veces. %(module)s no se encuentra en uso.

source: %(task_id)s of %(task_type)s not configured properly. Could not load the filesystem store
es: %(task_id)s de %(task_type)s no se ha configurado correctamente. No se pudo cargar el almacén de sistema de ficheo

source: %(task_id)s of %(task_type)s not configured properly. Missing work dir: %(work_dir)s
es: %(task_id)s de %(task_type)s no se ha configurado adecuadamente. Hace falta work dir: %(work_dir)s

source: %(verb)sing %(serv)s with %(conf)s
es: %(verb)s ing %(serv)s con %(conf)s

source: %s Please specify a host:port pair, where host is an IPv4 address, IPv6 address, hostname, or FQDN. If using an IPv6 address, enclose it in brackets separately from the port (i.e., "[fe80::a:b:c]:9876").
es: %s Por favor especifique el par host:puerto, en donde el host es una dirección IPv4, IPv6, nombre de host o FQDN. Si utiliza una dirección IPv6 enciérrela entre paréntesis separados del puerto (por ejemplo "[fe80::a:b:c]:9876").

source: %s can't contain 4 byte unicode characters.
es: %s no puede contener caracteres 4 byte unicode.

source: %s is already stopped
es: %s ya se detuvo

source: %s is stopped
es: %s se ha detenido

source: '%(param)s' value out of range, must not exceed %(max)d
es: Valor de '%(param)s' fuera de rango, no debe exceder %(max)d

source: --os_auth_url option or OS_AUTH_URL environment variable required when keystone authentication strategy is enabled
es: Se necesita la opción --os_auth_url ovariable de ambiente OS_AUTH_URL cuando la estrategia de autenticación keystone está habilitada

source: A list of artifacts that are allowed in the format name or name-version. Empty list means that any artifact can be loaded.
es: Una lista de artefactos que están permitidos en el nombre del formato o versión del nombre. Una lista vacía significa que se puede subir cualquier artefacto.

source: A metadata definition object with name=%(object_name)s already exists in namespace=%(namespace_name)s.
es: Ya existe el objeto para definición de metadatos de nombre=%(object_name)s en espacio de nombre=%(namespace_name)s.

source: A metadata definition property with name=%(property_name)s already exists in namespace=%(namespace_name)s.
es: Ya existe la propiedad para definición de metadatos de nombre=%(property_name)s en espacio de nombre=%(namespace_name)s.

source: A metadata definition resource-type with name=%(resource_type_name)s already exists.
es: Ya existe el tipo de recurso para definición de metadatos=%(resource_type_name)s

source: A metadata tag with name=%(name)s already exists in namespace=%(namespace_name)s.
es: Ya existe la etiqueta para metadatos de nombre=%(name)s en el espacio de nombre=%(namespace_name)s.

source: A set of URLs to access the image file kept in external store
es: Conjunto de URLs para acceder al archivo de imagen se mantiene en un almacén externo

source: AES key for encrypting store 'location' metadata. This includes, if used, Swift or S3 credentials. Should be set to a random string of length 16, 24 or 32 bytes
es: Clave ES para cifrar metadatos de la 'ubicación' del almacén. Esto incluye, si se utiliza, credenciales Swift o S3. Se debe configurar en una serie aleatoria de 16, 24 o 32 bytes de longitud

source: Address to bind the server. Useful when selecting a particular network interface.
es: Dirección para enlazar el servidor. Útil cuando se selecciona una interfaz particular de red.

source: Address to find the registry server.
es: La dirección para encontrar el servidor de registro.

source: Allow unauthenticated users to access the API with read-only privileges. This only applies when using ContextMiddleware.
es: Permite a los usuarios autenticados acceder a API con privilegio de solo-lectura. Solo aplica a usuarios de ContextMiddleware.

source: Allowed values %s are invalid under given validators
es: Los valores %s permitidos no son válidos bajo validadores proporcionados

source: Amount of disk space (in GB) required to boot image.
es: Cantidad de espacio de disco (en GB) necesario para la imagen de arranque.

source: Amount of ram (in MB) required to boot image.
es: Cantidad de RAM (en MB) necesario para la imagen de arranque.

source: An identifier for the image
es: Un identificador para la imagen

source: An identifier for the image member (tenantId)
es: Un identificador para el miembro de la imagen (tenantId)

source: An identifier for the owner of this task
es: Un identificador para el propietario de esta tarea

source: An identifier for the task
es: Un identificador para la tarea

source: An image with identifier %s already exists
es: Ya existe una imagen con el identificador %s

source: An object with the same identifier already exists.
es: Ya existe un objeto con el mismo identificador.

source: An object with the same identifier is currently being operated on.
es: Ya se está operando un objeto con el mismo identificador.

source: An object with the specified identifier was not found.
es: No se ha encontrado un objeto con el identificador especificado.

source: An unknown exception occurred
es: Se ha producido una excepción desconocida

source: An unknown task exception occurred
es: Se ha producido una excepción desconocida

source: Array has no element at position %d
es: La matríz no tiene un elemento en la posición %d

source: Array property can't have item_type=Array
es: La propiedad de matriz no puede contener item_type=Array

source: Artifact %s could not be deleted because it is in use: %s
es: No se pudo eliminar artefacto %s porque está en uso: %s

source: Artifact cannot change state from %(source)s to %(target)s
es: El artefacto no puede cambiar estado de %(source)s a %(target)s

source: Artifact has no property %(prop)s
es: El artefacto no tiene propiedad %(prop)s

source: Artifact state cannot be changed from %(curr)s to %(to)s
es: El artefacto no puede cambiar estado de %(curr)s a %(to)s

source: Artifact type with name '%(name)s' and version '%(version)s' is not known
es: El artefacto de nombre '%(name)s' y versión '%(version)s' es desconocido

source: Artifact with a circular dependency can not be created
es: No se puede crear artefacto con dependencia circular

source: Artifact with id=%(id)s is not accessible
es: No se puede acceder al artefacto con id=%(id)s

source: Artifact with id=%(id)s was not found
es: No se encontró artefacto identificado como=%(id)s

source: Artifact with the specified type, name and version already exists
es: Ya existe artefacto con el tipo, nombre versión especificada

source: Artifact with the specified type, name and version already has the direct dependency=%(dep)s
es: El artefacto con el tipo, nombre versión especificada ya tiene la dependencia directa=%(dep)s

source: Artifact with the specified type, name and version already has the transitive dependency=%(dep)s
es: El artefacto con el tipo, nombre versión especificada ya tiene la dependencia transitiva=%(dep)s

source: Attempt to set readonly property
es: Intento de configurar la propiedad solo-lectura

source: Attempt to set value of immutable property
es: Intento de configurar valor de la propiedad no permutable

source: Attempt to upload duplicate image: %s
es: Se ha intentado subir imagen duplicada: %s

source: Attempted to update Location field for an image not in queued status.
es: Se ha intentado actualizar el campo de ubicación para una imagen que no está en estado de cola.

source: Attribute '%(property)s' is read-only.
es: El atributo '%(property)s' es de sólo lectura.

source: Attribute '%(property)s' is reserved.
es: El atributo '%(property)s' está reservado.

source: Attribute '%s' is read-only.
es: El atributo '%s' es de solo lectura.

source: Attribute '%s' is reserved.
es: El atributo '%s' está reservado.

source: Attribute container_format can be only replaced for a queued image.
es: El atributo container_format solo se puede reemplazar por una imagen en cola.

source: Attribute disk_format can be only replaced for a queued image.
es: El atributo isk_format solo se puede remplazar con una imagen en cola.

source: Auth key for the user authenticating against the Swift authentication service. (deprecated)
es: La clave de autenticación para el usuario que se autentica con relación al servicio de autenticación Swift es escuchado (rechazado)

source: Auth service at URL %(url)s not found.
es: No se ha encontrado el servicio de autorización en el URL %(url)s.

source: Authorization failed.
es: Ha fallado la autorización.

source: Available categories:
es: Categorías disponibles:

source: Bad Command: %s
es: Comando incorrecto: %s

source: Bad header: %(header_name)s
es: Cabecera incorrecta: %(header_name)s

source: Bad value passed to filter %(filter)s got %(val)s
es: Valores incorrectos pasaron al filtro %(filter)s se obtuvo %(val)s

source: Badly formed S3 URI: %(uri)s
es: La URI S3 se realizó de manera incorrecta: %(uri)s

source: Badly formed credentials '%(creds)s' in Swift URI
es: Credenciales formadas incorrectamente '%(creds)s' en URI de Swift

source: Badly formed credentials in Swift URI.
es: Credenciales con formato incorrecto en URI de Swift.

source: Base directory that the Image Cache uses.
es: El directorio base que utiliza el Caché de Imagen.

source: Blob %(name)s may not have multiple values
es: Es probable que el objeto %(name)s no contenga valores múltiples

source: Blob size is not set
es: El tamaño del objeto no está establecido

source: Body expected in request.
es: Se esperaba un cuerpo en la solicitud.

source: Both file and legacy_image_id may not be specified at the same time
es: No se debe especificar un fichero y legacy_image_id al mismo tiempo

source: CA certificate file to use to verify connecting clients.
es: Fichero de certificado CA a utilizar para verificar la conexión de clientes.

source: Cannot be a negative value
es: No puede ser un valor negativo

source: Cannot be a negative value.
es: No puede ser un valor negativo.

source: Cannot convert image %(key)s '%(value)s' to an integer.
es: No se puede convertir imagen %(key)s '%(value)s' en un entero.

source: Cannot declare artifact property with reserved name 'metadata'
es: No se puede declarar propiedad de artefacto con el nombre 'metadatos' reservado

source: Cannot load artifact '%(name)s'
es: No se puede cargar artefacto '%(name)s'

source: Cannot replace locations from a non-empty list to a non-empty list.
es: No se puede remplazar ubicaciones desde una lista no vacía a una lista no vacía.

source: Cannot save data for image %(image_id)s: %(error)s
es: No se pueden guardar los datos para la imagen %(image_id)s: %(error)s

source: Cannot specify 'max_size' explicitly
es: No se puede especificar 'max_size' de manera explícita

source: Cannot specify 'min_size' explicitly
es: No se puede especificar 'min_size' de manera explícita

source: Cannot upload to an unqueued image
es: No se puede subir a una imagen en cola

source: Cannot use this parameter with the operator %(op)s
es: No se puede utilizar este parámetro con el operador %(op)s

source: Certificate file to use when starting API server securely.
es: Fichero de certificado a usar cuando de inicia servidor API con seguridad.

source: Checksum verification failed. Aborted caching of image '%s'.
es: Se ha encontrado un error en la verificación de la suma de comprobación. Se ha abortado el almacenamiento en memoria caché de la imagen '%s'.

source: Client disconnected before sending all data to backend
es: El cliente se desconecto antes de enviar todos los datos a backend

source: Command not found
es: Comando no encontrado

source: Configuration option was not valid
es: La opción de configuración no era válida

source: Connect error/bad request to Auth service at URL %(url)s.
es: Solicitud incorrecta/error de conexión a servicio de autorización en el URL %(url)s.

source: Constructed URL: %s
es: URL construido : %s

source: Container format is not specified.
es: No se especificó el formato de contenedor.

source: Content-Type must be application/octet-stream
es: El tipo de contenido debe ser aplicación/serie de octetos

source: Corrupt image download for image %(image_id)s
es: Descarga de imagen corrupta para imagen %(image_id)s

source: Could not bind to %(host)s:%(port)s after trying for 30 seconds
es: No se ha podido enlazar con %(host)s:%(port)s después de intentarlo durante 30 segundos

source: Could not find metadata object %s
es: No se pudo encontrar el objeto de metadatos %s

source: Could not find metadata tag %s
es: No se pudo encontrar la etiqueta de metadatos %s

source: Could not find namespace %s
es: No se ha podido encontrar el espacio de nombre %s

source: Could not find property %s
es: No se pudo encontrar propiedad %s

source: Could not find required configuration option
es: No se ha podido encontrar la opción de configuración necesaria

source: Could not find task %s
es: No se encontró tarea %s

source: Could not update image: %s
es: No se ha podido actualizar la imagen: %s

source: Custom validators list should contain tuples '(function, message)'
es: La lista de verificador personalizada debe contener tuplas '(función, mensaje)'

source: Data supplied was not valid.
es: Los datos proporcionados no son válidos.

source: Date and time of image member creation
es: Fecha y hora de creación del miembro de la imagen

source: Date and time of image registration (READ-ONLY)
es: Fecha y hora del registro de imagen (SOLO-LECTURA)

source: Date and time of last modification of image member
es: Fecha y hora de la última modificación del miembro de la imagen

source: Date and time of namespace creation (READ-ONLY)
es: Fecha y hora de creación del espacio de nombre (SOLO-LECTURA)

source: Date and time of object creation (READ-ONLY)
es: Fecha y hora de creación del objeto (SOLO-LECTURA)

source: Date and time of resource type association (READ-ONLY)
es: Fecha y hora de asociación del tipo de recurso (SOLO-LECTURA)

source: Date and time of tag creation (READ-ONLY)
es: Fecha y hora de creación de la etiqueta (SOLO-LECTURA)

source: Date and time of the last image modification (READ-ONLY)
es: Fecha y hora de la última modificación de la imagen (SOLO-LECTURA)

source: Date and time of the last namespace modification (READ-ONLY)
es: Fecha y hora de la última modificación de espacio de nombre (SOLO-LECTURA)

source: Date and time of the last object modification (READ-ONLY)
es: Fecha y hora de la última modificación del objeto (SOLO-LECTURA)

source: Date and time of the last resource type association modification (READ-ONLY)
es: Fecha y hora de la última modificación de la asociación del tipo de recurso (SOLO-LECTURA)

source: Date and time of the last tag modification (READ-ONLY)
es: Fecha y hora de la última modificación de la etiqueta (SOLO-LECTURA)

source: Datetime when this resource was created
es: Fecha en la cual se creó este recurso

source: Datetime when this resource was updated
es: Fecha en la cual se actualizó este recurso

source: Datetime when this resource would be subject to removal
es: Fecha en la cual este recurso estará sujeto a eliminación

source: Default value for the number of items returned by a request if not specified explicitly in the request
es: Valor predeterminado para el número de elementos devueltos por una solicitud si no se especifica de forma explícita en la solicitud

source: Default value is invalid
es: El valor por defecto no es válido

source: Denying attempt to upload artifact because it exceeds the quota: %s
es: Denegando intento de carga de artefacto porque excede la capacidad: %s

source: Denying attempt to upload image because it exceeds the quota: %s
es: Denegando intento de carga de imagen porque excede la capacidad: %s

source: Denying attempt to upload image larger than %d bytes.
es: Denegando intento de cargar una imagen mayor que %d bytes.

source: Dependency property '%s' has to be deleted first
es: Se debe eliminar primero la propiedad de dependencia '%s'

source: Dependency relations cannot be mutable
es: Las relaciones de dependencia no se pueden permutar

source: Deploy the v1 OpenStack Images API.
es: Implemente la API de imágenes v1 de OpenStack.

source: Deploy the v1 OpenStack Registry API.
es: Implemente la API de registro v1 de OpenStack.

source: Deploy the v2 OpenStack Images API.
es: Despliegue la API de imágenes v2 de OpenStack.

source: Deploy the v2 OpenStack Registry API.
es: Despliegue la API de registro v2 de OpenStack.

source: Deploy the v3 OpenStack Objects API.
es: Implemente la API de objetos v3 de OpenStack.

source: Descriptive name for the image
es: Nombre descriptivo para la imagen

source: Determining version of request: %(method)s %(path)s Accept: %(accept)s
es: Determinando la versión de la solicitud: %(method)s %(path)s Aceptar: %(accept)s

source: Dictionary contains unexpected key(s)
es: El diccionario contiene clave(s) inesperadas

source: Dictionary size is greater than maximum
es: El tamaño del diccionario es es mayor que el máximo

source: Dictionary size is less than minimum
es: El tamaño del diccioanrio es menor que el mínimo

source: Digest algorithm which will be used for digital signature. Use the command "openssl list-message-digest-algorithms" to get the available algorithmssupported by the version of OpenSSL on the platform. Examples are "sha1", "sha256", "sha512", etc.
es: Algoritmo Digest que será usado para la firma digital. Usa el comando "openssl list-message-digest-algorithmsl" para ver los algoritmos disponibles soportados por la version de OpenSSL en la plataforma. Ejemplos son "sha1", "sha256", "sha512", etc.

source: Disk format is not specified.
es: No se especificó el formato del disco.

source: Does not match pattern
es: No coincide el patrón

source: Driver %(driver_name)s could not be configured correctly. Reason: %(reason)s
es: El controlador %(driver_name)s no se ha podido configurar correctamente. Razón: %(reason)s

source: Either a file or a legacy_image_id has to be specified
es: Se debe especificar un fichero o legacy_image_id

source: Encountered service with no "type": %s
es: Se ha encontrado un servicio sin "type": %s

source: Error in store configuration. Adding images to store is disabled.
es: Error en la configuración del almacén. Se ha inhabilitado la adición de imágenes a almacen.

source: External sources are not supported: '%s'
es: No se soportan fuentes externas: '%s'

source: Failed to activate image. Got error: %s
es: Error al activar imagen. Se ha obtenido error: %s

source: Failed to add image metadata. Got error: %s
es: Error al agregar metadatos de imagen. Se obtuvo error: %s

source: Failed to find artifact %(artifact_id)s to delete
es: No se pudo encontrar artefacto %(artifact_id)s para eliminar

source: Failed to find image %(image_id)s to delete
es: No se pudo encontrar imagen %(image_id)s para eliminar

source: Failed to find image to delete: %s
es: No se ha encontrado la imagen para eliminar: %s

source: Failed to find image to update: %s
es: No se encontró imagen para actualizar: %s

source: Failed to find resource type %(resourcetype)s to delete
es: No se encontró tipo de recurso %(resourcetype)s para eliminar

source: Failed to initialize the image cache database. Got error: %s
es: No se ha podido inicializar la base de datos de memoria caché de imagen. Se ha obtenido error: %s

source: Failed to read %s from config
es: No se ha podido leer %s de la configuración

source: Failed to reserve image. Got error: %s
es: Error al reservar imagen. Se ha obtenido error: %s

source: Failed to update image metadata. Got error: %s
es: No se han podido actualizar metadatos de imagen. Se ha obtenido error: %s

source: Failed to upload image %s
es: No se cargó imagen %s

source: Failed to upload image data for image %(image_id)s due to HTTP error: %(error)s
es: No se permite cargar datos de imagen para imagen %(image_id)s a causa de un error HTTP: %(error)s

source: Failed to upload image data for image %(image_id)s due to internal error: %(error)s
es: Error al cargar datos de imagen para imagen %(image_id)s a causa de un error interno: %(error)s

source: File based imports are not allowed. Please use a non-local source of image data.
es: No se permiten las importaciones basadas en ficheros. Por favor use una fuente no-local de datos de imagen.

source: File too large
es: El fichero es demasiado grande

source: File too small
es: El fichero es demasiado pequeño

source: Forbidden to delete a %s image.
es: Se prohíbe eliminar una imagen %s.

source: Forbidden to delete image: %s
es: Está prohibido eliminar imagen: %s

source: Forbidden to modify '%s' of active image.
es: Está prohibido modificar '%s' de imagen activa.

source: Forbidden to reserve image.
es: La reserva de imagen está prohibida.

source: Forbidden to update deleted image.
es: La actualización de una imagen suprimida está prohibida.

source: Forbidden to update image: %s
es: Se prohíbe actualizar imagen: %s

source: Forbidden upload attempt: %s
es: Intento de carga prohibido: %s

source: Forbidding request, metadata definition namespace=%s is not visible.
es: Solicitud no permitida, el espacio de nombre para la definición de metadatos=%s no es visible

source: Forbidding request, task %s is not visible
es: Solicitud no permitida, la tarea %s no es visible

source: Format of the container
es: Formato del contenedor

source: Format of the disk
es: Formato del disco

source: Get blob %(name)s data failed: %(err)s.
es: Error al obtener datos de objeto %(name)s : %(err)s.

source: Get image %(id)s data failed: %(err)s.
es: Error al obtener información de imagen %(id)s : %(err)s.

source: Host "%s" is not valid.
es: Host "%s" no es válido.

source: Host and port "%s" is not valid.
es: Host y puerto "%s" no es válido.

source: Human-readable informative message only included when appropriate (usually on failure)
es: Solo se incluye mensaje informativo legible para humanos cuando sea apropiado (usualmente en error)

source: If False doesn't trace SQL requests.
es: Si Falce no rastrea solicitudes SQL.

source: If False fully disable profiling feature.
es: Si es False inhabilita completamente la característica de perfilado.

source: If False, server will return the header "Connection: close", If True, server will return "Connection: Keep-Alive" in its responses. In order to close the client socket connection explicitly after the response is sent and read successfully by the client, you simply have to set this option to False when you create a wsgi server.
es: Si es False, el servidor devolverá la cabecera "Conexión: cerrada" en sus respuestas, si es True, el servidor devolverá la cabecera "Conexión: Keep-Alive". Para cerrar la conexión de pila del cliente explícitamente antes de enviar la respuesta y de que se la lea el cliente, simplemente debe configurar la opción False cuando cree un servidor wsgi.
