Repository: openstack/glance
Catalog: glance/locale/*/LC_MESSAGES/glance.po
Languages: es

source: If true, image will not be deletable.
es: Si es true, la imagen no se podrá suprimir.

source: If true, namespace will not be deletable.
es: Si es true, no se podrá eliminar el espacio de nombre.

source: Image %(id)s could not be deleted because it is in use: %(exc)s
es: No se pudo eliminar imagen %(id)s porque está en uso: %(exc)s

source: Image %(id)s not found
es: No se ha encontrado la imagen %(id)s

source: Image %(image_id)s could not be found after upload. The image may have been deleted during the upload: %(error)s
es: No se pudo encontrar imagen %(image_id)s después de subirla. Es posible que la imagen haya sido eliminada durante la carga: %(error)s

source: Image %(image_id)s is protected and cannot be deleted.
es: La imagen %(image_id)s está protegida y no se puede suprimir.

source: Image %s could not be found after upload. The image may have been deleted during the upload, cleaning up the chunks uploaded.
es: No se pudo encontrar la imagen %s después de subirla. Es posible que la imagen haya sido eliminada durante la carga, limpiando los fragmentos cargados.

source: Image %s is deactivated
es: Se ha desactivado la imagen %s

source: Image %s is not active
es: La imagen %s no está activa

source: Image %s not found.
es: No se encontró imagen %s.

source: Image exceeds the storage quota: %s
es: La imagen excede la capacidad de almacenamiento: %s

source: Image id is required.
es: Se necesita id de imagen

source: Image is protected
es: La imagen está protegida

source: Image member limit exceeded for image %(id)s: %(e)s:
es: Se ha excedido el límite de miembro de imagen para imagen %(id)s: %(e)s:

source: Image name too long: %d
es: Nombre de imagen demasiado largo: %d

source: Image operation conflicts
es: Conflictos de operación de imagen

source: Image status transition from %(cur_status)s to %(new_status)s is not allowed
es: No se permite la transición de estado %(cur_status)s a %(new_status)s

source: Image storage media is full: %s
es: El soporte de almacenamiento de imagen está lleno: %s

source: Image tag limit exceeded for image %(id)s: %(e)s:
es: Se ha excedido el límite de etiqueta de imagen para imagen %(id)s: %(e)s:

source: Image upload problem: %s
es: Problema al cargar la imagen: %s

source: Image with identifier %s already exists!
es: ¡Ya existe una imagen con el identificador %s!

source: Image with identifier %s has been deleted.
es: Se ha eliminado imagen identificada como %s.

source: Image with identifier %s not found
es: No se ha encontrado la imagen con el identificador %s

source: Image with the given id %(image_id)s was not found
es: No se ha podido encontrar la imagen con ID %(image_id)s

source: Incorrect auth strategy, expected "%(expected)s" but received "%(received)s"
es: Estrategia de autorización incorrecta, se esperaba "%(expected)s" pero se ha recibido "%(received)s"

source: Incorrect request: %s
es: Solicitud incorrecta: %s

source: Index is out of range
es: El índice está fuera de alcance

source: Index is required
es: Se necesita índexación

source: Input does not contain '%(key)s' field
es: La entrada no contiene el campo '%(key)s'

source: Insufficient permissions on image storage media: %s
es: Permisos insuficientes en el soporte de almacenamiento de imagen: %s

source: Invalid JSON pointer for this resource: '/%s'
es: Puntero JSON no válido para este recurso: '/%s'

source: Invalid checksum '%s': can't exceed 32 characters
es: Suma de verificación '%s': no puede exceder los 32 caracteres

source: Invalid configuration in glance-swift conf file.
es: Configuración en fichero en glance-swift no válida.

source: Invalid configuration in property protection file.
es: Configuración en fichero de protección de propiedad no válida.

source: Invalid container format '%s' for image.
es: Formato de contenedor '%s' no válido para imagen.

source: Invalid content type %(content_type)s
es: Tipo de contenido no válido %(content_type)s

source: Invalid dict property type
es: Tipo de propiedad del diccionario no válido

source: Invalid dict property type specification
es: Especificación de tipo de propiedad del diccionario no válida

source: Invalid disk format '%s' for image.
es: Formato de disco '%s' no válido para imagen.

source: Invalid image id format
es: Formato de id de imagen no válido

source: Invalid item type specification
es: Especificación de tipo del elemento no válida

source: Invalid json body: %s
es: Cuerpo de json no válido: %s

source: Invalid jsonpatch request
es: Solicitud de jsonpatch no válida

source: Invalid location
es: Ubicación no válida

source: Invalid location %s
es: Ubicación %s no válida

source: Invalid location: %s
es: Ubicaciones no válidas: %s

source: Invalid location_strategy option: %(name)s. The valid strategy option(s) is(are): %(strategies)s
es: Opción location_strategy no válida: %(name)s. La opción(es) válida(s) es/son: %(strategies)s

source: Invalid locations
es: Ubicaciones no válidas

source: Invalid locations: %s
es: Ubicaciones no válidas: %s

source: Invalid marker format
es: Formato de marcador no válido

source: Invalid marker. Image could not be found.
es: Marcador no válido. No se ha podido encontrar la imagen.

source: Invalid membership association: %s
es: Asociación de pertenencia no válida: %s

source: Invalid mix of disk and container formats. When setting a disk or container format to one of 'aki', 'ari', or 'ami', the container and disk formats must match.
es: Mezcla no válida de formatos de disco y contenedor. Al definir un formato de disco o de contenedor como 'aki', 'ari' o 'ami', los formatos de contenedor y de disco deben coincidir.

source: Invalid operation: `%(op)s`. It must be one of the following: %(available)s.
es: Operación: `%(op)s` no válida. Debe ser una de las siguientes: %(available)s.

source: Invalid position for adding a location.
es: Posición no válida para agregar ubicación.

source: Invalid position for removing a location.
es: Posición no válida para eliminar ubicación.

source: Invalid property definition
es: Definición de propiedad no válida

source: Invalid reference list specification
es: Especificación de lista de referencia no válida

source: Invalid referenced type
es: Tipo referenciado no váido

source: Invalid service catalog json.
es: JSON de catálogo de servicios no válido.

source: Invalid sort direction: %s
es: Dirección de ordenación no válida : %s

source: Invalid sort key: %(sort_key)s. If type version is not set it must be one of the following: %(available)s.
es: Clave de ordenación no válida: %(sort_key)s. Si la versión de tipo no está configurada debe ser una de las siguientes: %(available)s.

source: Invalid sort key: %(sort_key)s. It must be one of the following: %(available)s.
es: Clave de ordenación no válida: %(sort_key)s. Debe ser una de las siguientes: %(available)s.

source: Invalid sort key: %(sort_key)s. You cannot sort by this property
es: Clave de ordenación no válida: %(sort_key)s. No puede ordenar por medio de esta propiedad

source: Invalid status value: %s
es: Valor de estado no válido: %s

source: Invalid status: %s
es: Estado no válido: %s

source: Invalid type definition
es: Definición de tipo no válida

source: Invalid type value: %s
es: Valor de tipo no válido: %s

source: Invalid update. It would result in a duplicate metadata definition namespace with the same name of %s
es: Actualización no válida. Como resultado será un espacio de nombre para la definición de metadatos duplicado con el mismo nombre de %s

source: Invalid update. It would result in a duplicate metadata definition object with the same name=%(name)s in namespace=%(namespace_name)s.
es: Actualización no válida. El resultado será un objeto para la definición de metadatos duplicado con el mismo nombre de=%(name)s en el espacio de nombre=%(namespace_name)s.

source: Invalid update. It would result in a duplicate metadata definition object with the same name=%(name)s in namespace=%(namespace_name)s.
es: Actualización no válida. El resultado será un objeto para la definición de metadatos duplicado con el mismo nombre de=%(name)s en el espacio de nombre=%(namespace_name)s.

source: Invalid update. It would result in a duplicate metadata definition property with the same name=%(name)s in namespace=%(namespace_name)s.
es: Actualización no válida. El resultado será una propiedad para la definición de metadatos duplicada con el mismo nombre de=%(name)s en espacio de nombre=%(namespace_name)s.

source: Invalid value '%(value)s' for parameter '%(param)s': %(extra_msg)s
es: Valor no válido'%(value)s' para parametro '%(param)s': %(extra_msg)s

source: Invalid value for option %(option)s: %(value)s
es: Valor no válido para opción %(option)s: %(value)s

source: Invalid visibility value: %s
es: Valor de visibilidad no válido : %s

source: Is not allowed value
es: No es un valor permitido

source: It appears that the eventlet module has been imported prior to setting %s='yes'. It is currently necessary to disable eventlet.greendns if using ipv6 since eventlet.greendns currently breaks with ipv6 addresses. Please ensure that eventlet is not imported prior to this being set.
es: Es posible que el módulo eventlet se haya importado previamente a configuración %s='yes'. Actualmente se necesita inhabilitar eventlet.greendns si se está utilizando ipv6 ya que ahora eventlet.greendns se daña con direcciones ipv6. Por favor asegúrese de que eventlet no se importa antes de configurar esto.

source: It's invalid to provide multiple image sources.
es: Proporcionar múltiples fuentes para la imagen no es válido.

source: Items have to be unique
es: Los elementos deben ser únicos

source: Json path should start with a '/', end with no '/', no 2 subsequent '/' are allowed.
es: La ruta Json debe iniciar con a '/', finalizar con no '/', no se permiten 2 '/' subsecuentes.

source: Legacy image was not found
es: No se encontró herencia de imagen

source: Length is greater than maximum
es: El tamaño es mayor que el máximo

source: Length is less than minimum
es: El tamaño es menor que el mínimo

source: Limit param must be an integer
es: el parámetro de límite debe ser un entero

source: Limit param must be positive
es: el parámetro de límite debe ser positivo

source: Limit param must not be higher than %d
es: el parámetro de límite no debe ser mayor que %d

source: List definitions may hot have defaults
es: Es probable que las definiciones de lista no tengan predeterminados

source: List of strings related to the image
es: Lista de series relacionadas con la imagen

source: List size is greater than maximum
es: El tamaño de la lista es mayor que el máximo

source: List size is less than minimum
es: El tamaño de lista es menor que el mínimo

source: Loop time between checking for new items to schedule for delete.
es: Tiempo de bucle entre verificación para nuevos elementos para la planificación de eliminación.

source: Malformed Content-Range header: %s
es: Cabecera de Rango de Contenido incorrecta: %s

source: Malformed JSON in request body.
es: JSON con formato incorrecto en el cuerpo de la solicitud.

source: Max string length may not exceed 255 characters
es: El tamaño máximo de serie no debe exceder 255 caracteres

source: Maximum line size of message headers to be accepted. max_header_line may need to be increased when using large tokens (typically those generated by the Keystone v3 API with big service catalogs
es: El tamaño máximo de línea de cabecera de mensaje que se aceptará. Es probable que se necesite aumentar max_header_line al usar tokens grandes (generalmente los que Keystone v3 API genera con grandes catálogos de servicio

source: Maximum number of image members per image. Negative values evaluate to unlimited.
es: Número máximo de miembros de imagen por imagen. Los valores negativos se evalúan de manera ilimitada.

source: Maximum number of locations allowed on an image. Negative values evaluate to unlimited.
es: Número máximo de ubicaciones permitidas en una imagen. Los valores negativos se evalúan de manera ilimitada.

source: Maximum number of properties allowed on an image. Negative values evaluate to unlimited.
es: Número máximo de propiedades permitidas en una imagen. Los valores negativos se evalúan de manera ilimitada.

source: Maximum number of tags allowed on an image. Negative values evaluate to unlimited.
es: Número máximo de etiquetas permitidas en una imagen. Los valores negativos se evalúan de manera ilimitada.

source: Maximum permissible number of items that could be returned by a request
es: El número máximo permitido de elementos que podrían ser devueltos por una solicitud

source: Maximum redirects (%(redirects)s) was exceeded.
es: Se ha superado el máximo de redirecciones (%(redirects)s).

source: Maximum size of image a user can upload in bytes. Defaults to 1099511627776 bytes (1 TB).WARNING: this value should only be increased after careful consideration and must be set to a value under 8 EB (9223372036854775808).
es: El tamaño máximo que un usuario puede cargar en bytes. Por defecto hasta 1099511627776 bytes (1 TB).ADVERTENCIA: este valor solo se debe aumentar luego de considerarlo cuidadosamente y debe configurarse en un valor menor a 8 EB (9223372036854775808).

source: Member %(member_id)s is duplicated for image %(image_id)s
es: Se ha duplicado miembro %(member_id)s para imagen %(image_id)s

source: Member can't be empty
es: Miembro no puede estar vacío

source: Member to be added not specified
es: No se ha especificado el miembro que añadir

source: Membership could not be found.
es: La pertenencia no se ha podido encontrar.

source: Metadata definition namespace %(namespace)s is protected and cannot be deleted.
es: El espacio de nombre %(namespace)s de definición de metadatos está protegido y no puede eliminarse.

source: Metadata definition namespace not found for id=%s
es: No se encontró espacio de nombre para la definición de metadatos para id=%s

source: Metadata definition namespace=%(namespace_name)swas not found.
es: No se encontró el espacio de nombre para definición de metadatos=%(namespace_name)s.

source: Metadata definition object %(object_name)s is protected and cannot be deleted.
es: El objeto %(object_name)s de definición de metadatos está protegido y no puede eliminarse.

source: Metadata definition object not found for id=%s
es: No se encontró el objeto para la definición de metadatos para id=%s

source: Metadata definition property %(property_name)s is protected and cannot be deleted.
es: La propiedad %(property_name)s de definición de metadatos está protegida y no puede eliminarse.

source: Metadata definition property not found for id=%s
es: No se encontró propiedad para la definición de metadatos para id=%s

source: Metadata definition resource-type %(resource_type_name)s is a seeded-system type and cannot be deleted.
es: El tipo de recurso para la definición de metadatos %(resource_type_name)s es un tipo de sistema seeded y no puede eliminarse.

source: Metadata definition resource-type-association %(resource_type)s is protected and cannot be deleted.
es: La asociación de tipo de recurso %(resource_type)s de definición de metadatos está protegida y no puede eliminarse.

source: Metadata definition tag %(tag_name)s is protected and cannot be deleted.
es: Etiqueta de definición de metadatos %(tag_name)s está protegida y no puede eliminarse.

source: Metadata definition tag not found for id=%s
es: No se encontró etiqueta para la definición de metadatos para id=%s

source: Min string length may not be negative
es: El tamaño mínimo de serie no puede ser negativo

source: Missing required credential: %(required)s
es: Falta la credencial necesaria :%(required)s

source: Multiple 'image' service matches for region %(region)s. This generally means that a region is required and you have not supplied one.
es: Varias coincidencias de servicio 'image' para la región %(region)s. Esto generalmente significa que es necesaria una región y que no se ha proporcionado ninguna.

source: Name of the paste configuration file.
es: Nombre del fichero de configuración de pegado.

source: No artifact found with ID %s
es: No se encontró artefacto con ID %s

source: No authenticated user
es: Ningún usuario autenticado

source: No image data could be found
es: No se han encontrado datos de imagen

source: No image found with ID %s
es: No se encontró imagen con ID %s

source: No location found with ID %(loc)s from image %(img)s
es: No se encontró ubicación con ID %(loc)s de imagen %(img)s

source: No permission to share that image
es: No existe permiso para compartir esa imagen

source: No plugin for '%(name)s' has been loaded
es: No se ha cargado complemento para '%(name)s'

source: No property to access
es: No existe propiedad a la cual acceder

source: No such key '%s' in a dict
es: No hay tal clave '%s' en un dict

source: Not a blob property '%s'
es: '%s' no es una propiedad de objeto

source: Not a downloadable entity
es: No es una entidad descargable

source: Not a list property
es: No es una propiedad de lista

source: Not a list property '%s'
es: '%s' no es una propiedad de lista

source: Not a valid value type
es: Tipo de valor no válido

source: Not all dependencies are in '%s' state
es: No todas las dependencias de encuentran en estado '%s'

source: Not allowed to create members for image %s.
es: No se permite crear miembros para imagen %s.

source: Not allowed to deactivate image in status '%s'
es: No está permitido eliminar imagen en estado '%s'

source: Not allowed to delete members for image %s.
es: No se permite eliminar miembros para imagen %s.

source: Not allowed to delete tags for image %s.
es: No se permite eliminar etiquetas para imagen %s.

source: Not allowed to list members for image %s.
es: No se permite listar miembros para imagen %s.

source: Not allowed to reactivate image in status '%s'
es: No está permitido reactivar imagen en estado'%s'

source: Not allowed to update members for image %s.
es: No se permite actualizar miembros para imagen %s.

source: Not allowed to update tags for image %s.
es: No se permite actualizar etiquetas para imagen %s.

source: Not allowed to upload image data for image %(image_id)s: %(error)s
es: No se permite cargar datos de imagen para imagen %(image_id)s: %(error)s

source: Not an array idx '%s'
es: '%s' no es un índice matriz

source: Number of sort dirs does not match the number of sort keys
es: El número de dirs de ordenación no coincide con el número de claves de ordenación

source: Old and new sorting syntax cannot be combined
es: No se puede combinar la antigua y nueva sintaxis de ordenación

source: Only list indexes are allowed for blob lists
es: Solo se permiten índices de lista para listas de objeto

source: Operation "%s" requires a member named "value".
es: La operación "%s" requiere un miembro llamado "value".

source: Operation objects must contain exactly one member named "add", "remove", or "replace".
es: Los objetos de operación pueden contener exactamente un miembro llamado "add", "remove" o "replace".

source: Operation objects must contain only one member named "add", "remove", or "replace".
es: Los objetos de operación solo pueden contener un miembro llamado "add", "remove" o "replace".

source: Operations must be JSON objects.
es: Las operaciones deben ser objetos JSON.

source: Operator %(op)s is not supported
es: No se soporta operador %(op)s

source: Original locations is not empty: %s
es: Las ubicaciones originales no están vacías: %s

source: Owner must be specified to create a tag.
es: Se debe especificar el propietario para crear etiqueta.

source: Owner of the image
es: Propietario de la imagen

source: Owner of the namespace.
es: Propietario del espacio de nombre.

source: Param values can't contain 4 byte unicode.
es: Los valores de parámetro no pueden contener 4 byte unicode.

source: Partial name of a pipeline in your paste configuration file with the service name removed. For example, if your paste section name is [pipeline:glance-api-keystone] use the value "keystone"
es: Se eliminó el nombre parcial de una segmentación en el fichero de configuración de pegado con el nombre de servicio. Por ejemplo, si pega la sección de nombre [pipeline:glance-api-keystone] utilice el valor "keystone"

source: Path to the directory where json metadata files are stored
es: Ruta al directorio en donde se almacenan los ficheros de metadatos json

source: Plugin name '%(plugin)s' should match artifact typename '%(name)s'
es: El nombre de complemento '%(plugin)s' debe coincidir con el nombre de tipo de artefacto %(name)s'

source: Pointer `%s` contains "~" not part of a recognized escape sequence.
es: El puntero `%s` contiene un "~" que no forma parte de una secuencia de escape reconocida.

source: Pointer `%s` contains adjacent "/".
es: El puntero `%s` contiene adyacente "/".

source: Pointer `%s` does not contains valid token.
es: El puntero `%s` contiene un token no válido.

source: Pointer `%s` does not start with "/".
es: El puntero `%s` no empieza por "/".

source: Pointer `%s` end with "/".
es: El puntero `%s` termina en "/".

source: Pointer contains '~' which is not part of a recognized escape sequence [~0, ~1].
es: El puntero contiene un "~" que no forma parte de una secuencia de escape reconocida [~0, ~1].

source: Port "%s" is not valid.
es: Puerto "%s" no es válido.

source: Port the registry server is listening on.
es: EL puerto en el cual el servidor de registro escucha.

source: Prerelease numeric component is too large (%d characters max)
es: El componente numérico de la versión anterior es demasiado largo (%d caracteres máx)

source: Private key file to use when starting API server securely.
es: Fichero de clave privado a usar cuando de inicia servidor API con seguridad.

source: Process %d not running
es: No se está ejecutando proceso %d

source: Properties %s must be set prior to saving data.
es: Las propiedades %s deben definirse antes de guardar datos.

source: Property %(property_name)s does not start with the expected resource type association prefix of '%(prefix)s'.
es: La propiedad %(property_name)s no inicia con el prefijo de asociación del tipo de recurso esperado de '%(prefix)s'.

source: Property %s already present.
es: La propiedad %s ya está presente.

source: Property %s does not exist.
es: La propiedad %s no existe.

source: Property %s may not be removed.
es: La propiedad %s no se puede eliminar.

source: Property %s must be set prior to saving data.
es: La propiedad %s debe definirse antes de guardar datos.

source: Property '%(name)s' may not have value '%(val)s': %(msg)s
es: Es probable que la propiedad '%(name)s' no tenga valor '%(val)s': %(msg)s

source: Property '%s' is protected
es: Propiedad '%s' está protegida

source: Property names can't contain 4 byte unicode.
es: Los nombre de propiedad no pueden contener 4 byte unicode.

source: Property protection on operation %(operation)s for rule %(rule)s is not found. No role will be allowed to perform this operation.
es: No se encontró protección de propiedad en operación %(operation)s para regla %(rule)s. Ningún rol permitirá realizar esta operación.

source: Property's %(prop)s value has not been found
es: No se ha encontrado valor de la propiedad %(prop)s

source: Provided header feature is unsupported: %(feature)s
es: La característica de cabecera proporcionada no está soportada: %(feature)s

source: Provided image size must match the stored image size. (provided size: %(ps)d, stored size: %(ss)d)
es: El tamaño de imagen proporcionado debe coincidir con el tamaño de la imagen almacenada. (tamaño proporcionado: %(ps)d, tamaño almacenado: %(ss)d)

source: Provided object does not match schema '%(schema)s': %(reason)s
es: El objeto proporcionado no coincide con el esquema '%(schema)s': %(reason)s
