Repository: openstack/glance
Catalog: glance/locale/*/LC_MESSAGES/glance-log-info.po
Languages: es, fr

source: %(task_id)s of %(task_type)s completed
es: %(task_id)s de %(task_type)s completada

source: 'metadata_encryption_key' was not specified in the config file or a config file was not specified. This means that this migration is a NOOP.
es: 'metadata_encryption_key' no se ha especificado en el archivo de configuración, o no se ha especificado ningún archivo de configuración. Esto significa que esta migración es NOOP.
fr: L'élément 'metadata_encryption_key' n'est pas spécifié dans le fichier config ou bien aucun fichier config n'est spécifié. Cela signifie que cette migration est un NOOP.

source: Access denied to image %(id)s but returning 'not found'
es: Acceso denegado a la imagen %(id)s aunque se devuelve 'not found'
fr: Accès refusé à l'image %(id)s mais renvoi de 'non trouvé'

source: All workers have terminated. Exiting
es: Todos los trabajadores han terminado. Saliendo
fr: Tous les agents ont terminé. Quittez

source: Artifact %s has been successfully loaded
es: El artefacto %s se ha cargado correctamente

source: Calling %(funcname)s: args=%(args)s, kwargs=%(kwargs)s
es: Llamando a %(funcname)s: args=%(args)s, kwargs=%(kwargs)s
fr: Appel de %(funcname)s : args = %(args)s, kwargs = %(kwargs)s

source: Caught keyboard interrupt. Exiting.
es: Se ha generado interrupción de teclado. Saliendo.
fr: Interruption interceptée de clavier. Fermeture du programme en cours.

source: Child %d exiting normally
es: El hijo %d está saliendo de forma normal
fr: Sortie normale de l'enfant %d

source: Cleaning up %s after exceeding the quota
es: Limpiando %s luego de exceder la capacidad

source: Cleaning up %s after exceeding the quota.
es: Limpiando %s luego de exceder la capacidad.

source: Considering: %s
es: Considerando: %s
fr: considérant : %s

source: Could not find artifact %s
es: No se pudo encontrar artefacto %s

source: Daemon Shutdown on KeyboardInterrupt
es: Conclusión de daemon en KeyboardInterrupt
fr: Arrêt du serveur démon sur KeyboardInterrupt

source: Defaulting to SQLite driver.
es: Se toma de forma predeterminada el controlador SQLite.
fr: Utilisation par défaut du pilote SQLite.

source: Delete denied for public image %(id)s
es: Se ha denegado la supresión para la imagen pública %(id)s
fr: Suppression refusée pour l'image publique %(id)s

source: File %s loaded to database.
es: Se ha cargado fichero %s a la base de datos.
fr: Fichier %s chargé dans la base de données.

source: Image %(id)s not found
es: No se ha encontrado la imagen %(id)s
fr: Image %(id)s non trouvé

source: Image %s could not be found after upload. The image may have been deleted during the upload.
es: No se puede encontrar imagen %s después de la carga. Es posible que la imagen haya sido eliminada durante la carga.

source: Image %s is being synced
es: Se está sincronizando imagen %s

source: Image %s is deactivated
es: Se ha desactivado la imagen %s

source: Image %s is reactivated
es: Se ha reactivado la imagen %s

source: Image %s metadata has changed
es: Metadatos de imagen %s ha cambiado

source: Image cache loaded driver '%s'.
es: La memoria caché de imagen ha cargado el controlador '%s'.
fr: Le cache d'image a chargé le pilote '%s'.

source: Initialized gzip middleware
es: Se ha iniciado gzip middleware

source: Initialized image cache management middleware
es: Middleware de gestión de memoria caché de imágenes inicializado
fr: Middleware de gestion du cache d'image initialisé

source: Initialized image cache middleware
es: Middleware de memoria caché de imágenes inicializado
fr: Middleware de cache d'image initialisé

source: Initializing scrubber with configuration: %s
es: Iniciando depurador con configuración: %s

source: Loading known task scripts for task_id %(task_id)s of type %(task_type)s
es: Cargando scripts de tarea reconocidos para task_id %(task_id)s de tipo %(task_type)s

source: Metadata loading finished
es: Ha concluido la carga de metadatos

source: Namespace %(namespace)s saved in %(file)s
es: Se ha guardado espacio de nombre %(namespace)s en %(file)s
fr: Namespace %(namespace)s est sauvegardé dans %(file)s

source: Not queueing image '%s'. Already being written to cache
es: No se está poniendo en cola la imagen '%s'. Ya se está grabando en la memoria caché
fr: Aucune mise en file d'attente de l'image '%s'. Déjà écrite en cache

source: Not queueing image '%s'. Already cached.
es: No se está poniendo en cola la imagen '%s'. Ya está almacenada en memoria caché.
fr: Aucune mise en file d'attente de l'image '%s'. Déjà en cache.

source: Not queueing image '%s'. Already queued.
es: No se está poniendo en cola la imagen '%s'. Ya está en cola.
fr: Aucune mise en file d'attente de l'image '%s'. Déjà en file d'attente.

source: Overwriting namespace %s
es: Reemplazando espacio de nombre %s

source: Reaped %(reaped)s %(entry_type)s cache entries
es: Se han obtenido %(reaped)s entradas de memoria caché %(entry_type)s
fr: %(reaped)s %(entry_type)s entrées de cache régulées

source: Rejecting image creation request for invalid image id '%(bad_id)s'
es: Rechazando la solicitud de creación de imagen para el ID de imagen no válido '%(bad_id)s'
fr: Rejet de la demande de création d'image pour l'ID image non valide '%(bad_id)s'

source: Removed dead child %s
es: Se ha eliminado hijo muerto %s

source: Removed invalid cache file %s
es: Se ha eliminado el archivo de memoria caché no válido %s
fr: Fichier cache non valide supprimé %s

source: Removed stale child %s
es: Se ha eliminado hijo obsoleto %s

source: Removed stalled cache file %s
es: Se ha eliminado el archivo de memoria caché colgado %s
fr: Fichier cache bloqué supprimé %s

source: Returning %(funcname)s: %(output)s
es: Devolviendo %(funcname)s: %(output)s
fr: Retour de %(funcname)s : %(output)s

source: Scrubbing image %(id)s from %(count)d locations.
es: Depurando imagen %(id)s de ubicaciones %(count)d.

source: Skipping namespace %s. It already exists in the database.
es: Omitiendo nombre de espacio %s. Ya existe en la base de datos.

source: Started child %s
es: Se ha iniciado el hijo %s
fr: Enfant démarré %s

source: Starting %d workers
es: Iniciando %d trabajadores
fr: Démarrage des workers %d

source: Starting Daemon: wakeup_time=%(wakeup_time)s threads=%(threads)s
es: Iniciando daemon: wakeup_time=%(wakeup_time)s threads=%(threads)s
fr: Démarrage du serveur démon : wakeup_time=%(wakeup_time)s threads=%(threads)s

source: Starting single process server
es: Iniciando servidor de proceso individual
fr: Démarrage de serveur de processus unique

source: Storing: %s
es: Almacenamiento: %s
fr: Stockage: %s

source: Successfully cached all %d images
es: Se han almacenado satisfactoriamente en memoria caché todas las %d imágenes
fr: Mise en cache réussie de l'ensemble des %d images

source: Successfully created image %(id)s
es: La imagen %(id)s se ha creado correctamente
fr: La création de l'image %(id)s a abouti

source: Successfully deleted a membership from image %(id)s
es: Se ha suprimido correctamente una pertenencia desde la imagen %(id)s
fr: La suppression d'une appartenance de l'image %(id)s a abouti

source: Successfully deleted image %(id)s
es: La imagen %(id)s Se ha suprimido correctamente
fr: La suppression de l'image %(id)s a abouti

source: Successfully updated a membership for image %(id)s
es: Se ha actualizado correctamente una pertenencia para la imagen %(id)s
fr: Mise à jour d'une appartenance effectuée pour l'image %(id)s

source: Successfully updated memberships for image %(id)s
es: Se han actualizado correctamente las pertenencias para la imagen %(id)s
fr: Mise à jour des appartenance effectuée pour l'image %(id)s

source: Table %s has been cleared
es: Se ha limpiado tabla %s

source: Task %(task_id)s beginning import execution.
es: Comenzando ejecución de importación para tarea %(task_id)s

source: Task %(task_id)s: Could not import image file %(image_data)s
es: Tarea %(task_id)s: No pudo importar fichero de imagn %(image_data)s

source: Task %(task_id)s: Got image data uri %(data_uri)s to be imported
es: Tarea %(task_id)s: Obtuvo uri de datos de imagen %(data_uri)s para importar

source: Task [%(task_id)s] status changing from %(cur_status)s to %(new_status)s
es: Cambiando estado de tarea [%(task_id)s] de %(cur_status)s a %(new_status)s

source: Triggering asynchronous copy from external source
es: Desencadenando copia asíncrona desde origen externo
fr: Déclenchement de copie asynchrone depuis une source externe

source: Unable to get deleted image
es: No se ha podido obtener una imagen suprimida
fr: Impossible de supprimer l'image

source: Update denied for public image %(id)s
es: Actualización denegada para la imagen pública %(id)s
fr: Mise à jour refusée pour l'image publique %(id)s

source: Updating metadata for image %(id)s
es: Actualizando metadatos para la imagen %(id)s
fr: Mise à jour des métadonnées pour l'image %(id)s

source: Uploaded data of image %s from request payload successfully.
es: Se ha subido de manera exitosa la información de imagen %s de la carga útil de solicitud.

source: creating table %(table)s
es: creando la tabla %(table)s
fr: création de la table %(table)s

source: dropping table %(table)s
es: descartando la tabla %(table)s
fr: suppression de la table %(table)s

source: Getting images deleted before %s
fr: Obtention des images supprimées avant %s

source: Eventlet backdoor listening on %(port)s for process %(pid)d
fr: Eventlet backdoor en écoute sur le port %(port)s for process %(pid)d

source: Caught %s, exiting
fr: %s interceptée, sortie

source: Parent process has died unexpectedly, exiting
fr: Le processus parent s'est soudainement achevé sans raison, sortie

source: Child caught %s, exiting
fr: L'enfant a reçu %s, sortie

source: Forking too fast, sleeping
fr: Bifurcation trop rapide, en veille

source: Started child %d
fr: Démarrage du dépendant %d

source: Child %(pid)d killed by signal %(sig)d
fr: %(pid)d du dépendant annihilés par le signal %(sig)d

source: Child %(pid)s exited with status %(code)d
fr: %(pid)s du dépendant sortis avec le statut %(code)d

source: Caught %s, stopping children
fr: %s intercepté, arrêtant les dépendants

source: Wait called after thread killed. Cleaning up.
fr: Pause demandée après suppression de thread. Nettoyage.

source: Waiting on %d children to exit
fr: En attente de sortie des dépendants %d
